[
  {
    "GlossaryEntries": [
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "An ability check tests a character's or monster's innate talent and training in an effort to overcome a challenge. The DM calls for an ability check when a character or monster attempts an action (other than an attack) that has a chance of failure. When the outcome is uncertain, the dice determine the results.\r\n\r\nFor every ability check, the DM decides which of the six abilities is relevant to the task at hand and the difficulty of the task, represented by a Difficulty Class. The more difficult a task, the higher its DC. The Typical Difficulty Classes table shows the most common DCs.\r\n\r\nTo make an ability check, roll a d20 and add the relevant ability modifier. As with other d20 rolls, apply bonuses and penalties, and compare the total to the DC. If the total equals or exceeds the DC, the ability check is a success--the creature overcomes the challenge at hand. Otherwise, it's a failure, which means the character or monster makes no progress toward the objective or makes progress combined with a setback determined by the DM.",
        "Name": "Ability Checks"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Sometimes a special ability or spell tells you that you have advantage or disadvantage on an ability check, a saving throw, or an attack roll. When that happens, you roll a second d20 when you make the roll. Use the higher of the two rolls if you have advantage, and use the lower roll if you have disadvantage. For example, if you have disadvantage and roll a 17 and a 5, you use the 5. If you instead have advantage and roll those numbers, you use the 17.\r\n\r\nIf multiple situations affect a roll and each one grants advantage or imposes disadvantage on it, you don't roll more than one additional d20. If two favorable situations grant advantage, for example, you still roll only one additional d20.\r\n\r\nIf circumstances cause a roll to have both advantage and disadvantage, you are considered to have neither of them, and you roll one d20. This is true even if multiple circumstances impose disadvantage and only one grants advantage or vice versa. In such a situation, you have neither advantage nor disadvantage.\r\n\r\nWhen you have advantage or disadvantage and something in the game, such as the halfling's Lucky trait, lets you reroll or replace the d20, you can reroll or replace only one of the dice. You choose which one. For example, if a halfling has advantage or disadvantage on an ability check and rolls a 1 and a 13, the halfling could use the Lucky trait to reroll the 1.\r\n\r\nYou usually gain advantage or disadvantage through the use of special abilities, actions, or spells. Inspiration can also give a character advantage. The DM can also decide that circumstances influence a roll in one direction or the other and grant advantage or impose disadvantage as a result.",
        "Name": "Advantage and Disadvantage"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Strength measures bodily power, athletic training, and the extent to which you can exert raw physical force.\r\n\r\n\r\n## %{color:steelblue}Strength Checks%\r\n\r\nA Strength check can model any attempt to lift, push, pull, or break something, to force your body through a space, or to otherwise apply brute force to a situation. The Athletics skill reflects aptitude in certain kinds of Strength checks.\r\n\r\n\r\n## %{color:steelblue}Athletics%\r\n\r\nYour Strength (Athletics) check covers difficult situations you encounter while climbing, jumping, or swimming. Examples include the following activities:\r\n\r\n* You attempt to climb a sheer or slippery cliff, avoid hazards while scaling a wall, or cling to a surface while something is trying to knock you off.\r\n* You try to jump an unusually long distance or pull off a stunt midjump.\r\n* You struggle to swim or stay afloat in treacherous currents, storm-tossed waves, or areas of thick seaweed. Or another creature tries to push or pull you underwater or otherwise interfere with your swimming.\r\n\r\n## %{color:steelblue}Other Strength Checks%\r\n\r\nThe DM might also call for a Strength check when you try to accomplish tasks like the following:\r\n\r\n* Force open a stuck, locked, or barred door\r\n* Break free of bonds\r\n* Push through a tunnel that is too small\r\n* Hang on to a wagon while being dragged behind it\r\n* Tip over a statue\r\n* Keep a boulder from rolling\r\n\r\n## %{color:steelblue}Attack Rolls and Damage%\r\n\r\nYou add your Strength modifier to your attack roll and your damage roll when attacking with a melee weapon such as a mace, a battleaxe, or a javelin. You use melee weapons to make melee attacks in hand-to-hand combat, and some of them can be thrown to make a ranged attack.\r\n\r\n\r\n## %{color:steelblue}Lifting and Carrying%\r\n\r\nYour Strength score determines the amount of weight you can bear. The following terms define what you can lift or carry.\r\n\r\n__Carrying Capacity__. Your carrying capacity is your Strength score multiplied by 15. This is the weight (in pounds) that you can carry, which is high enough that most characters don't usually have to worry about it.\r\n\r\n__Push, Drag, or Lift__. You can push, drag, or lift a weight in pounds up to twice your carrying capacity (or 30 times your Strength score). While pushing or dragging weight in excess of your carrying capacity, your speed drops to 5 feet.\r\n\r\n__Size and Strength__. Larger creatures can bear more weight, whereas Tiny creatures can carry less. For each size category above Medium, double the creature's carrying capacity and the amount it can push, drag, or lift. For a Tiny creature, halve these weights.\r\n\r\n\r\n## %{color:steelblue}Variant: Encumbrance%\r\n\r\nThe rules for lifting and carrying are intentionally simple. Here is a variant if you are looking for more detailed rules for determining how a character is hindered by the weight of equipment.\r\n\r\nIf you carry weight in excess of 5 times your Strength score, you are encumbered, which means your speed drops by 10 feet.\r\n\r\nIf you carry weight in excess of 10 times your Strength score, up to your maximum carrying capacity, you are instead heavily encumbered, which means your speed drops by 20 feet and you have disadvantage on ability checks, attack rolls, and saving throws that use Strength, Dexterity, or Constitution.\r\n",
            "Name": "Strength"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Dexterity measures agility, reflexes, and balance.\r\n\r\n## %{color:steelblue}Dexterity Checks%\r\n\r\nA Dexterity check can model any attempt to move nimbly, quickly, or quietly, or to keep from falling on tricky footing. The Acrobatics, Sleight of Hand, and Stealth skills reflect aptitude in certain kinds of Dexterity checks.\r\n\r\n## %{color:steelblue}Acrobatics%\r\n\r\nYour Dexterity (Acrobatics) check covers your attempt to stay on your feet in a tricky situation, such as when you're trying to run across a sheet of ice, balance on a tightrope, or stay upright on a rocking ship's deck. The DM might also call for a Dexterity (Acrobatics) check to see if you can perform acrobatic stunts, including dives, rolls, somersaults, and flips.\r\n\r\n## %{color:steelblue}Sleight of Hand%\r\n\r\nWhenever you attempt an act of legerdemain or manual trickery, such as planting something on someone else or concealing an object on your person, make a Dexterity (Sleight of Hand) check. The DM might also call for a Dexterity (Sleight of Hand) check to determine whether you can lift a coin purse off another person or slip something out of another person's pocket.\r\n\r\n## %{color:steelblue}Stealth%\r\n\r\nMake a Dexterity (Stealth) check when you attempt to conceal yourself from enemies, slink past guards, slip away without being noticed, or sneak up on someone without being seen or heard.\r\n\r\n## %{color:steelblue}Other Dexterity Checks%\r\n\r\nThe DM might call for a Dexterity check when you try to accomplish tasks like the following:\r\n* Control a heavily laden cart on a steep descent\r\n* Steer a chariot around a tight turn\r\n* Pick a lock\r\n* Disable a trap\r\n* Securely tie up a prisoner\r\n* Wriggle free of bonds\r\n* Play a stringed instrument\r\n* Craft a small or detailed object\r\n\r\n## %{color:steelblue}Attack Rolls and Damage%\r\n\r\nYou add your Dexterity modifier to your attack roll and your damage roll when attacking with a ranged weapon, such as a sling or a longbow. You can also add your Dexterity modifier to your attack roll and your damage roll when attacking with a melee weapon that has the finesse property, such as a dagger or a rapier.\r\n\r\n## %{color:steelblue}Armor Class%\r\n\r\nDepending on the armor you wear, you might add some or all of your Dexterity modifier to your Armor Class, as described in chapter 5, \"Equipment.\"\r\n\r\n## %{color:steelblue}Initiative%\r\n\r\nAt the beginning of every combat, you roll initiative by making a Dexterity check. Initiative determines the order of creatures' turns in combat, as described in chapter 9, \"Combat.\"",
            "Name": "Dexterity"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Constitution measures health, stamina, and vital force.\r\n\r\n## %{color:steelblue}Constitution Checks%\r\n\r\nConstitution checks are uncommon, and no skills apply to Constitution checks, because the endurance this ability represents is largely passive rather than involving a specific effort on the part of a character or monster. A Constitution check can model your attempt to push beyond normal limits, however.\r\n\r\nThe DM might call for a Constitution check when you try to accomplish tasks like the following:\r\n* Hold your breath\r\n* March or labor for hours without rest\r\n* Go without sleep\r\n* Survive without food or water\r\n* Quaff an entire stein of ale in one go\r\n\r\n## %{color:steelblue}Hit Points%\r\n\r\nYour Constitution modifier contributes to your hit points. Typically, you add your Constitution modifier to each Hit Die you roll for your hit points.\r\n\r\nIf your Constitution modifier changes, your hit point maximum changes as well, as though you had the new modifier from 1st level. For example, if you raise your Constitution score when you reach 4th level and your Constitution modifier increases from +1 to +2, you adjust your hit point maximum as though the modifier had always been +2. So you add 3 hit points for your first three levels, and then roll your hit points for 4th level using your new modifier. Or if you're 7th level and some effect lowers your Constitution score so as to reduce your Constitution modifier by 1, your hit point maximum is reduced by 7.",
            "Name": "Constitution"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Intelligence measures mental acuity, accuracy of recall, and the ability to reason.\r\n\r\n## %{color:steelblue}Intelligence Checks%\r\n\r\nAn Intelligence check comes into play when you need to draw on logic, education, memory, or deductive reasoning. The Arcana, History, Investigation, Nature, and Religion skills reflect aptitude in certain kinds of Intelligence checks.\r\n\r\n## %{color:steelblue}Arcana%\r\n\r\nYour Intelligence (Arcana) check measures your ability to recall lore about spells, magic items, eldritch symbols, magical traditions, the planes of existence, and the inhabitants of those planes.\r\n\r\n## %{color:steelblue}History%\r\n\r\nYour Intelligence (History) check measures your ability to recall lore about historical events, legendary people, ancient kingdoms, past disputes, recent wars, and lost civilizations.\r\n\r\n## %{color:steelblue}Investigation%\r\n\r\nWhen you look around for clues and make deductions based on those clues, you make an Intelligence (Investigation) check. You might deduce the location of a hidden object, discern from the appearance of a wound what kind of weapon dealt it, or determine the weakest point in a tunnel that could cause it to collapse. Poring through ancient scrolls in search of a hidden fragment of knowledge might also call for an Intelligence (Investigation) check.\r\n\r\n## %{color:steelblue}Nature%\r\n\r\nYour Intelligence (Nature) check measures your ability to recall lore about terrain, plants and animals, the weather, and natural cycles.\r\n\r\n## %{color:steelblue}Religion%\r\n\r\nYour Intelligence (Religion) check measures your ability to recall lore about deities, rites and prayers, religious hierarchies, holy symbols, and the practices of secret cults.\r\n\r\n## %{color:steelblue}Other Intelligence Checks%\r\n\r\nThe DM might call for an Intelligence check when you try to accomplish tasks like the following:\r\n* Communicate with a creature without using words\r\n* Estimate the value of a precious item\r\n* Pull together a disguise to pass as a city guard\r\n* Forge a document\r\n* Recall lore about a craft or trade\r\n* Win a game of skill\r\n\r\n## %{color:steelblue}Spellcasting Ability%\r\n\r\nWizards use Intelligence as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.",
            "Name": "Intelligence"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Wisdom reflects how attuned you are to the world around you and represents perceptiveness and intuition.\r\n\r\n## %{color:steelblue}Wisdom Checks%\r\n\r\nA Wisdom check might reflect an effort to read body language, understand someone’s feelings, notice things about the environment, or care for an injured person. The Animal Handling, Insight, Medicine, Perception, and Survival skills reflect aptitude in certain kinds of Wisdom checks.\r\n\r\n## %{color:steelblue}Animal Handling%\r\n\r\nWhen there is any question whether you can calm down a domesticated animal, keep a mount from getting spooked, or intuit an animal’s intentions, the DM might call for a Wisdom (Animal Handling) check. You also make a Wisdom (Animal Handling) check to control your mount when you attempt a risky maneuver.\r\n\r\n## %{color:steelblue}Insight%\r\n\r\nYour Wisdom (Insight) check decides whether you can determine the true intentions of a creature, such as when searching out a lie or predicting someone’s next move. Doing so involves gleaning clues from body language, speech habits, and changes in mannerisms.\r\n\r\n## %{color:steelblue}Medicine%\r\n\r\nA Wisdom (Medicine) check lets you try to stabilize a dying companion or diagnose an illness.\r\n\r\n## %{color:steelblue}Perception%\r\n\r\nYour Wisdom (Perception) check lets you spot, hear, or otherwise detect the presence of something. It measures your general awareness of your surroundings and the keenness of your senses. For example, you might try to hear a conversation through a closed door, eavesdrop under an open window, or hear monsters moving stealthily in the forest. Or you might try to spot things that are obscured or easy to miss, whether they are orcs lying in ambush on a road, thugs hiding in the shadows of an alley, or candlelight under a closed secret door.\r\n\r\n## %{color:steelblue}Survival%\r\n\r\nThe DM might ask you to make a Wisdom (Survival) check to follow tracks, hunt wild game, guide your group through frozen wastelands, identify signs that owlbears live nearby, predict the weather, or avoid quicksand and other natural hazards.\r\n\r\n## %{color:steelblue}Other Wisdom Checks%\r\n\r\nThe DM might call for a Wisdom check when you try to accomplish tasks like the following:\r\n* Get a gut feeling about what course of action to follow\r\n* Discern whether a seemingly dead or living creature is undead\r\n\r\n## %{color:steelblue}Spellcasting Ability%\r\n\r\nClerics, druids, and rangers use Wisdom as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.",
            "Name": "Wisdom"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Charisma measures your ability to interact effectively with others. It includes such factors as confidence and eloquence, and it can represent a charming or commanding personality.\r\n\r\n## %{color:steelblue}Charisma Checks%\r\n\r\nA Charisma check might arise when you try to influence or entertain others, when you try to make an impression or tell a convincing lie, or when you are navigating a tricky social situation. The Deception, Intimidation, Performance, and Persuasion skills reflect aptitude in certain kinds of Charisma checks.\r\n\r\n## %{color:steelblue}Deception%\r\n\r\nYour Charisma (Deception) check determines whether you can convincingly hide the truth, either verbally or through your actions. This deception can encompass everything from misleading others through ambiguity to telling outright lies. Typical situations include trying to fast-talk a guard, con a merchant, earn money through gambling, pass yourself off in a disguise, dull someone's suspicions with false assurances, or maintain a straight face while telling a blatant lie.\r\n\r\n## %{color:steelblue}Intimidation%\r\n\r\nWhen you attempt to influence someone through overt threats, hostile actions, and physical violence, the DM might ask you to make a Charisma (Intimidation) check. Examples include trying to pry information out of a prisoner, convincing street thugs to back down from a confrontation, or using the edge of a broken bottle to convince a sneering vizier to reconsider a decision.\r\n\r\n## %{color:steelblue}Performance%\r\n\r\nYour Charisma (Performance) check determines how well you can delight an audience with music, dance, acting, storytelling, or some other form of entertainment.\r\n\r\n## %{color:steelblue}Persuasion%\r\n\r\nWhen you attempt to influence someone or a group of people with tact, social graces, or good nature, the DM might ask you to make a Charisma (Persuasion) check. Typically, you use persuasion when acting in good faith, to foster friendships, make cordial requests, or exhibit proper etiquette. Examples of persuading others include convincing a chamberlain to let your party see the king, negotiating peace between warring tribes, or inspiring a crowd of townsfolk.\r\n\r\n## %{color:steelblue}Other Charisma Checks%\r\n\r\nThe DM might call for a Charisma check when you try to accomplish tasks like the following:\r\n* Find the best person to talk to for news, rumors, and gossip\r\n* Blend into a crowd to get the sense of key topics of conversation\r\n\r\n## %{color:steelblue}Spellcasting Ability%\r\n\r\nBards, paladins, sorcerers, and warlocks use Charisma as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.",
            "Name": "Charisma"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Every task that a character or monster might attempt in the game is covered by one of the six abilities. This section explains in more detail what those abilities mean and the ways they are used in the game.",
        "Name": "Attributes"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Sometimes one character's or monster's efforts are directly opposed to another's. This can occur when both of them are trying to do the same thing and only one can succeed, such as attempting to snatch up a magic ring that has fallen on the floor.\r\n\r\nThis situation also applies when one of them is trying to prevent the other one from accomplishing a goal--for example, when a monster tries to force open a door that an adventurer is holding closed. In situations like these, the outcome is determined by a special form of ability check, called a contest.\r\n\r\nBoth participants in a contest make ability checks appropriate to their efforts. They apply all appropriate bonuses and penalties, but instead of comparing the total to a DC, they compare the totals of their two checks. The participant with the higher check total wins the contest. That character or monster either succeeds at the action or prevents the other one from succeeding.\r\n\r\nIf the contest results in a tie, the situation remains the same as it was before the contest. Thus, one contestant might win the contest by default. If two characters tie in a contest to snatch a ring off the floor, neither character grabs it. In a contest between a monster trying to open a door and an adventurer trying to keep the door closed, a tie means that the door remains shut.",
        "Name": "Contests"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "A passive check is a special kind of ability check that doesn't involve any die rolls. Such a check can represent the average result for a task done repeatedly, such as searching for secret doors over and over again, or can be used when the DM wants to secretly determine whether the characters succeed at something without rolling dice, such as noticing a hidden monster.\r\n\r\nHere's how to determine a character's total for a passive check:\r\n\r\n10 + all modifiers that normally apply to the check\r\n\r\nIf the character has advantage on the check, add 5. For disadvantage, subtract 5. The game refers to a passive check total as a score.\r\n\r\nFor example, if a 1st-level character has a Wisdom of 15 and proficiency in Perception, he or she has a passive Wisdom (Perception) score of 14.\r\nThe rules on hiding in the “Dexterity” section below rely on passive checks, as do the exploration rules.",
        "Name": "Passive Checks"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Your proficiency bonus can’t be added to a single die roll or other number more than once. For example, if two different rules say you can add your proficiency bonus to a Wisdom saving throw, you nevertheless add the bonus only once when you make the save.\r\n\r\nOccasionally, your proficiency bonus might be multiplied or divided (doubled or halved, for example) before you apply it. For example, the rogue’s Expertise feature doubles the proficiency bonus for certain ability checks. If a circumstance suggests that your proficiency bonus applies more than once to the same roll, you still add it only once and multiply or divide it only once.\r\n\r\nBy the same token, if a feature or effect allows you to multiply your proficiency bonus when making an ability check that wouldn’t normally benefit from your proficiency bonus, you still don’t add the bonus to the check. For that check your proficiency bonus is 0, given the fact that multiplying 0 by any number is still 0. For instance, if you lack proficiency in the History skill, you gain no benefit from a feature that lets you double your proficiency bonus when you make Intelligence (History) checks.\r\n\r\nIn general, you don’t multiply your proficiency bonus for attack rolls or saving throws. If a feature or effect allows you to do so, these same rules apply.",
        "Name": "Proficiency Bonus"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "A saving throw — also called a save — represents an attempt to resist a spell, a trap, a poison, a disease, or a similar threat. You don’t normally decide to make a saving throw; you are forced to make one because your character or monster is at risk of harm.\r\n\r\nTo make a saving throw, roll a d20 and add the appropriate ability modifier. For example, you use your Dexterity modifier for a Dexterity saving throw.\r\n\r\nA saving throw can be modified by a situational bonus or penalty and can be affected by advantage and disadvantage, as determined by the DM.\r\n\r\nEach class gives proficiency in at least two saving throws. The wizard, for example, is proficient in Intelligence saves. As with skill proficiencies, proficiency in a saving throw lets a character add his or her proficiency bonus to saving throws made using a particular ability score. Some monsters have saving throw proficiencies as well.\r\n\r\nThe Difficulty Class for a saving throw is determined by the effect that causes it. For example, the DC for a saving throw allowed by a spell is determined by the caster’s spellcasting ability and proficiency bonus.\r\n\r\nThe result of a successful or failed saving throw is also detailed in the effect that allows the save. Usually, a successful save means that a creature suffers no harm, or reduced harm, from an effect.",
        "Name": "Saving Throws"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Strength (Athletics) check covers difficult situations you encounter while climbing, jumping, or swimming. Examples include the following activities:\r\n\r\n* You attempt to climb a sheer or slippery cliff, avoid hazards while scaling a wall, or cling to a surface while something is trying to knock you off.\r\n* You try to jump an unusually long distance or pull off a stunt midjump.\r\n* You struggle to swim or stay afloat in treacherous currents, storm-tossed waves, or areas of thick seaweed. Or another creature tries to push or pull you underwater or otherwise interfere with your swimming.",
            "Name": "Athletics"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Dexterity (Acrobatics) check covers your attempt to stay on your feet in a tricky situation, such as when you're trying to run across a sheet of ice, balance on a tightrope, or stay upright on a rocking ship's deck. The GM might also call for a Dexterity (Acrobatics) check to see if you can perform acrobatic stunts, including dives, rolls, somersaults, and flips.",
            "Name": "Acrobatics"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Whenever you attempt an act of legerdemain or manual trickery, such as planting something on someone else or concealing an object on your person, make a Dexterity (Sleight of Hand) check. The GM might also call for a Dexterity (Sleight of Hand) check to determine whether you can lift a coin purse off another person or slip something out of another person's pocket.",
            "Name": "Sleight of Hand"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Make a Dexterity (Stealth) check when you attempt to conceal yourself from enemies, slink past guards, slip away without being noticed, or sneak up on someone without being seen or heard.",
            "Name": "Stealth"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Intelligence (Arcana) check measures your ability to recall lore about spells, magic items, eldritch symbols, magical traditions, the planes of existence, and the inhabitants of those planes.",
            "Name": "Arcana"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Intelligence (History) check measures your ability to recall lore about historical events, legendary people, ancient kingdoms, past disputes, recent wars, and lost civilizations.",
            "Name": "History"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you look around for clues and make deductions based on those clues, you make an Intelligence (Investigation) check. You might deduce the location of a hidden object, discern from the appearance of a wound what kind of weapon dealt it, or determine the weakest point in a tunnel that could cause it to collapse. Poring through ancient scrolls in search of a hidden fragment of knowledge might also call for an Intelligence (Investigation) check.",
            "Name": "Investigation"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Intelligence (Nature) check measures your ability to recall lore about terrain, plants and animals, the weather, and natural cycles.",
            "Name": "Nature"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Intelligence (Religion) check measures your ability to recall lore about deities, rites and prayers, religious hierarchies, holy symbols, and the practices of secret cults.",
            "Name": "Religion"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When there is any question whether you can calm down a domesticated animal, keep a mount from getting spooked, or intuit an animal’s intentions, the GM might call for a Wisdom (Animal Handling) check. You also make a Wisdom (Animal Handling) check to control your mount when you attempt a risky maneuver.",
            "Name": "Animal Handling"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Wisdom (Insight) check decides whether you can determine the true intentions of a creature, such as when searching out a lie or predicting someone’s next move. Doing so involves gleaning clues from body language, speech habits, and changes in mannerisms.",
            "Name": "Insight"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "A Wisdom (Medicine) check lets you try to stabilize a dying companion or diagnose an illness.",
            "Name": "Medicine"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Wisdom (Perception) check lets you spot, hear, or otherwise detect the presence of something. It measures your general awareness of your surroundings and the keenness of your senses. For example, you might try to hear a conversation through a closed door, eavesdrop under an open window, or hear monsters moving stealthily in the forest. Or you might try to spot things that are obscured or easy to miss, whether they are orcs lying in ambush on a road, thugs hiding in the shadows of an alley, or candlelight under a closed secret door.",
            "Name": "Perception"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "The GM might ask you to make a Wisdom (Survival) check to follow tracks, hunt wild game, guide your group through frozen wastelands, identify signs that owlbears live nearby, predict the weather, or avoid quicksand and other natural hazards.",
            "Name": "Survival"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Charisma (Deception) check determines whether you can convincingly hide the truth, either verbally or through your actions. This deception can encompass everything from misleading others through ambiguity to telling outright lies. Typical situations include trying to fast-talk a guard, con a merchant, earn money through gambling, pass yourself off in a disguise, dull someone's suspicions with false assurances, or maintain a straight face while telling a blatant lie.",
            "Name": "Deception"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you attempt to influence someone through overt threats, hostile actions, and physical violence, the GM might ask you to make a Charisma (Intimidation) check. Examples include trying to pry information out of a prisoner, convincing street thugs to back down from a confrontation, or using the edge of a broken bottle to convince a sneering vizier to reconsider a decision.",
            "Name": "Intimidation"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your Charisma (Performance) check determines how well you can delight an audience with music, dance, acting, storytelling, or some other form of entertainment.",
            "Name": "Performance"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you attempt to influence someone or a group of people with tact, social graces, or good nature, the GM might ask you to make a Charisma (Persuasion) check. Typically, you use persuasion when acting in good faith, to foster friendships, make cordial requests, or exhibit proper etiquette. Examples of persuading others include convincing a chamberlain to let your party see the king, negotiating peace between warring tribes, or inspiring a crowd of townsfolk.",
            "Name": "Persuasion"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Each ability covers a broad range of capabilities, including skills that a character or a monster can be proficient in. A skill represents a specific aspect of an ability score, and an individual's proficiency in a skill demonstrates a focus on that aspect. (A character's starting skill proficiencies are determined at character creation, and a monster's skill proficiencies appear in the monster's stat block.)\r\n\r\nFor example, a Dexterity check might reflect a character's attempt to pull off an acrobatic stunt, to palm an object, or to stay hidden. Each of these aspects of Dexterity has an associated skill: Acrobatics, Sleight of Hand, and Stealth, respectively. So a character who has proficiency in the Stealth skill is particularly good at Dexterity checks related to sneaking and hiding.\r\n\r\nThe skills related to each ability score are shown in the following list. (No skills are related to Constitution.) See an ability's description in the later sections of this section for examples of how to use a skill associated with an ability.\r\n\r\nSometimes, the DM might ask for an ability check using a specific skill--for example, “Make a Wisdom (Perception) check.” At other times, a player might ask the DM if proficiency in a particular skill applies to a check. In either case, proficiency in a skill means an individual can add his or her proficiency bonus to ability checks that involve that skill. Without proficiency in the skill, the individual makes a normal ability check.\r\n\r\nFor example, if a character attempts to climb up a dangerous cliff, the DM might ask for a Strength (Athletics) check. If the character is proficient in Athletics, the character's proficiency bonus is added to the Strength check. If the character lacks that proficiency, he or she just makes a Strength check.",
        "Name": "Skills"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Sometimes two or more characters team up to attempt a task. The character who's leading the effort--or the one with the highest ability modifier--can make an ability check with advantage, reflecting the help provided by the other characters. In combat, this requires the Help action.\r\n\r\nA character can only provide help if the task is one that he or she could attempt alone. For example, trying to open a lock requires proficiency with thieves' tools, so a character who lacks that proficiency can't help another character in that task.\r\n\r\nMoreover, a character can help only when two or more individuals working together would actually be productive. Some tasks, such as threading a needle, are no easier with help.\r\n\r\n## %{color:steelblue}Group Checks% \r\nWhen a number of individuals are trying to accomplish something as a group, the DM might ask for a group ability check. In such a situation, the characters who are skilled at a particular task help cover those who aren't.\r\n\r\nTo make a group ability check, everyone in the group makes the ability check. If at least half the group succeeds, the whole group succeeds.\r\n\r\nOtherwise, the group fails. Group checks don't come up very often, and they're most useful when all the characters succeed or fail as a group. For example, when adventurers are navigating a swamp, the DM might call for a group Wisdom (Survival) check to see if the characters can avoid the quicksand, sinkholes, and other natural hazards of the environment. If at least half the group succeeds, the successful characters are able to guide their companions out of danger. Otherwise, the group stumbles into one of these hazards.",
        "Name": "Working Together"
      }
    ],
    "IsExpanded": false,
    "Markdown": "Six abilities provide a quick description of every creature's physical and mental characteristics:\r\n\r\n* Strength, measuring physical power\r\n* Dexterity, measuring agility\r\n* Constitution, measuring endurance\r\n* Intelligence, measuring reasoning and memory\r\n* Wisdom, measuring perception and insight\r\n* Charisma, measuring force of personality\r\n\r\nIs a character muscle-bound and insightful? Brilliant and charming? Nimble and hardy? Ability scores define these qualities--a creature's assets as well as weaknesses. The three main rolls of the game -- the ability check, the saving throw, and the attack roll -- rely on the six ability scores. The Introduction describes the basic rule behind these rolls: roll a d20, add an ability modifier derived from one of the six ability scores, and compare the total to a target number.\r\n\r\nEach of a creature's abilities has a score, a number that defines the magnitude of that ability. An ability score is not just a measure of innate capabilities, but also encompasses a creature's training and competence in activities related to that ability.\r\n\r\nA score of 10 or 11 is the normal human average, but adventurers and many monsters are a cut above average in most abilities. A score of 18 is the highest that a person usually reaches. Adventurers can have scores as high as 20, and monsters and divine beings can have scores as high as 30.\r\n\r\nEach ability also has a modifier, derived from the score and ranging from -5 (for an ability score of 1) to +10 (for a score of 30). The Ability Scores and Modifiers table notes the ability modifiers for the range of possible ability scores, from 1 to 30.",
    "Name": "Ability Scores"
  },
  {
    "GlossaryEntries": [
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Delving into the ancient Tomb of Horrors, slipping through the back alleys of Waterdeep, hacking a fresh trail through the thick jungles on the Isle of Dread—these are the things that Dungeons & Dragons adventures are made of. Your character in the game might explore forgotten ruins and uncharted lands, uncover dark secrets and sinister plots, and slay foul monsters. And if all goes well, your character will survive to claim rich rewards before embarking on a new adventure.\r\n\r\nWhether adventurers are exploring a dusty dungeon or the complex relationships of a royal court, the game follows a natural rhythm, as outlined in the book’s introduction:\r\n* The DM describes the environment.\r\n* The players describe what they want to do.\r\n* The DM narrates the results of their actions.\r\n\r\nTypically, the DM uses a map as an outline of the adventure, tracking the characters’ progress as they explore dungeon corridors or wilderness regions. The DM’s notes, including a key to the map, describe what the adventurers find as they enter each new area. Sometimes, the passage of time and the adventurers’ actions determine what happens, so the DM might use a timeline or a flowchart to track their progress instead of a map.",
        "Name": "Adventuring"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Characters who don't eat or drink suffer the effects of exhaustion. Exhaustion caused by lack of food or water can't be removed until the character eats and drinks the full required amount.\r\n\r\n## %{color:steelblue}Food% \r\nA character needs one pound of food per day and can make food last longer by subsisting on half rations. Eating half a pound of food in a day counts as half a day without food.\r\n\r\nA character can go without food for a number of days equal to 3 + his or her Constitution modifier (minimum 1). At the end of each day beyond that limit, a character automatically suffers one level of exhaustion. A normal day of eating resets the count of days without food to zero.\r\n\r\n## %{color:steelblue}Water% \r\nA character needs one gallon of water per day, or two gallons per day if the weather is hot. A character who drinks only half that much water must succeed on a DC 15 Constitution saving throw or suffer one level of exhaustion at the end of the day. A character with access to even less water automatically suffers one level of exhaustion at the end of the day.\r\n\r\nIf the character already has one or more levels of exhaustion, the character takes two levels in either case.",
        "Name": "Food and Water"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Every character and monster has a speed, which is the distance in feet that the character or monster can walk in 1 round. This number assumes short bursts of energetic movement in the midst of a life-threatening situation. The following rules determine how far a character or monster can move in a minute, an hour, or a day.\r\n\r\n## %{color:steelblue}Travel Pace%\r\nWhile traveling, a group of adventurers can move at a normal, fast, or slow pace, as shown on the Travel Pace table. The table states how far the party can move in a period of time and whether the pace has any effect. A fast pace makes characters less perceptive, while a slow pace makes it possible to sneak around and to search an area more carefully.\r\n\r\n### %{color:steelblue}Forced March%\r\nThe Travel Pace table assumes that characters travel for 8 hours in day. They can push on beyond that limit, at the risk of exhaustion.\r\n\r\nFor each additional hour of travel beyond 8 hours, the characters cover the distance shown in the Hour column for their pace, and each character must make a Constitution saving throw at the end of the hour. The DC is 10 + 1 for each hour past 8 hours. On a failed saving throw, a character suffers one level of exhaustion.\r\n\r\n### %{color:steelblue}Mounts and Vehicles%\r\nFor short spans of time (up to an hour), many animals move much faster than humanoids. A mounted character can ride at a gallop for about an hour, covering twice the usual distance for a fast pace. If fresh mounts are available every 8 to 10 miles, characters can cover larger distances at this pace, but this is very rare except in densely populated areas.\r\n\r\nCharacters in wagons, carriages, or other land vehicles choose a pace as normal. Characters in a waterborne vessel are limited to the speed of the vessel, and they don't suffer penalties for a fast pace or gain benefits from a slow pace. Depending on the vessel and the size of the crew, ships might be able to travel for up to 24 hours per day.\r\n\r\n## %{color:steelblue}Difficult Terrain%\r\nThe travel speeds given in the Travel Pace table assume relatively simple terrain: roads, open plains, or clear dungeon corridors. But adventurers often face dense forests, deep swamps, rubble-filled ruins, steep mountains, and ice-covered ground--all considered difficult terrain.\r\n\r\nYou move at half speed in difficult terrain--moving 1 foot in difficult terrain costs 2 feet of speed--so you can cover only half the normal distance in a minute, an hour, or a day.",
            "Name": "Speed"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "As adventurers travel through a dungeon or the wilderness, they need to remain alert for danger, and some characters might perform other tasks to help the group’s journey.\r\n\r\n## %{color:steelblue}Marching Order%\r\nThe adventurers should establish a marching order. A marching order makes it easier to determine which characters are affected by traps, which ones can spot hidden enemies, and which ones are the closest to those enemies when a fight breaks out.\r\n\r\nA character might occupy the front rank, one or more middle ranks, or the back rank. Characters in the front and back ranks need enough room to travel side by side with others in their rank. When space is too tight, the marching order must change, usually by moving characters to a middle rank.\r\n\r\n## %{color:steelblue}Stealth%\r\nWhile traveling at a slow pace, the characters can move stealthily. As long as they’re not in the open, they can try to surprise or sneak by other creatures they encounter. See the rules for hiding in the Using Ability Scores section.\r\n\r\n## %{color:steelblue}Noticing Threats%\r\nUse the passive Wisdom (Perception) scores of the characters to determine whether anyone in the group notices a hidden threat. The DM might decide that a threat can be noticed only by characters in a particular rank. For example, as the characters are exploring a maze of tunnels, the DM might decide that only those characters in the back rank have a chance to hear or spot a stealthy creature following the group, while characters in the front and middle ranks cannot.\r\n\r\nWhile traveling at a fast pace, characters take a –5 penalty to their passive Wisdom (Perception) scores to notice hidden threats.",
            "Name": "Traveling"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Movement through dangerous dungeons or wilderness areas often involves more than simply walking. Adventurers might have to climb, crawl, swim, or jump to get where they need to go.\r\n\r\n## %{color:steelblue}Climbing, Swimming, and Crawling%\r\nEach foot of movement costs 1 extra foot (2 extra feet in difficult terrain) when you’re climbing, swimming, or crawling. You ignore this extra cost if you have a climbing speed and use it to climb or a swimming speed and use it to swim. At the DM’s option, climbing a slippery vertical surface or one with few handholds requires a successful Strength (Athletics) check. Similarly, gaining any distance in rough water might require a successful Strength (Athletics) check.\r\n\r\n## %{color:steelblue}Jumping%\r\nYour Strength determines how far you can jump.\r\n\r\n### %{color:steelblue}Long Jump%\r\nWhen you make a long jump, you cover a number of feet up to your Strength score if you move at least 10 feet on foot immediately before the jump. When you make a standing long jump, you can leap only half that distance. Either way, each foot you clear on the jump costs a foot of movement.\r\n\r\nThis rule assumes that the height of your jump doesn't matter, such as a jump across a stream or chasm. At your DM's option, you must succeed on a DC 10 Strength (Athletics) check to clear a low obstacle (no taller than a quarter of the jump's distance), such as a hedge or low wall. Otherwise, you hit it.\r\n\r\nWhen you land in difficult terrain, you must succeed on a DC 10 Dexterity (Acrobatics) check to land on your feet. Otherwise, you land prone.\r\n\r\n### %{color:steelblue}High Jump%\r\nWhen you make a high jump, you leap into the air a number of feet equal to 3 + your Strength modifier (minimum of 0 feet) if you move at least 10 feet on foot immediately before the jump. When you make a standing high jump, you can jump only half that distance. Either way, each foot you clear on the jump costs a foot of movement. In some circumstances, your DM might allow you to make a Strength (Athletics) check to jump higher than you normally can.\r\n\r\nYou can extend your arms half your height above yourself during the jump. Thus, you can reach above you a distance equal to the height of the jump plus 1 1/2 times your height.",
            "Name": "Special Movement"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Swimming across a rushing river, sneaking down a dungeon corridor, scaling a treacherous mountain slope--all sorts of movement play a key role in fantasy gaming adventures.\r\n\r\nThe DM can summarize the adventurers' movement without calculating exact distances or travel times: \"You travel through the forest and find the dungeon entrance late in the evening of the third day.\" Even in a dungeon, particularly a large dungeon or a cave network, the DM can summarize movement between encounters: \"After killing the guardian at the entrance to the ancient dwarven stronghold, you consult your map, which leads you through miles of echoing corridors to a chasm bridged by a narrow stone arch.\"\r\n\r\nSometimes it's important, though, to know how long it takes to get from one spot to another, whether the answer is in days, hours, or minutes. The rules for determining travel time depend on two factors: the speed and travel pace of the creatures moving and the terrain they're moving over.\r\n\r\n## %{color:steelblue}Falling% \r\nA fall from a great height is one of the most common hazards facing an adventurer. At the end of a fall, a creature takes 1d6 bludgeoning damage for every 10 feet it fell, to a maximum of 20d6. The creature lands prone, unless it avoids taking damage from the fall.",
        "Name": "Movement"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Heroic though they might be, adventurers can't spend every hour of the day in the thick of exploration, social interaction, and combat. They need rest--time to sleep and eat, tend their wounds, refresh their minds and spirits for spellcasting, and brace themselves for further adventure.\r\n\r\nAdventurers, as well as other creatures, can take short rests in the midst of a day and a long rest to end it.\r\n\r\n## %{color:steelblue}Short Rest%\r\nA short rest is a period of downtime, at least 1 hour long, during which a character does nothing more strenuous than eating, drinking, reading, and tending to wounds.\r\n\r\nA character can spend one or more Hit Dice at the end of a short rest, up to the character's maximum number of Hit Dice, which is equal to the character's level. For each Hit Die spent in this way, the player rolls the die and adds the character's Constitution modifier to it. The character regains hit points equal to the total (minimum of 0). The player can decide to spend an additional Hit Die after each roll. A character regains some spent Hit Dice upon finishing a long rest, as explained below.\r\n\r\n## %{color:steelblue}Long Rest%\r\nA long rest is a period of extended downtime, at least 8 hours long, during which a character sleeps for at least 6 hours and performs no more than 2 hours of light activity, such as reading, talking, eating, or standing watch. If the rest is interrupted by a period of strenuous activity - at least 1 hour of walking, fighting, casting spells, or similar adventuring activity - the characters must begin the rest again to gain any benefit from it.\r\n\r\nAt the end of a long rest, a character regains all lost hit points. The character also regains spent Hit Dice, up to a number of dice equal to half of the character's total number of them (minimum of one die). For example, if a character has eight Hit Dice, he or she can regain four spent Hit Dice upon finishing a long rest.\r\n\r\nA character can't benefit from more than one long rest in a 24-hour period, and a character must have at least 1 hit point at the start of the rest to gain its benefits.",
        "Name": "Resting"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "A creature can hold its breath for a number of minutes equal to 1 + its Constitution modifier (minimum of 30 seconds).\r\n\r\nWhen a creature runs out of breath or is choking, it can survive for a number of rounds equal to its Constitution modifier (minimum of 1 round). At the start of its next turn, it drops to 0 hit points and is dying, and it can't regain hit points or be stabilized until it can breathe again.\r\n\r\nFor example, a creature with a Constitution of 14 can hold its breath for 3 minutes. If it starts suffocating, it has 2 rounds to reach air before it drops to 0 hit points.",
        "Name": "Suffocating"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "In situations where keeping track of the passage of time is important, the DM determines the time a task requires. The DM might use a different time scale depending on the context of the situation at hand. In a dungeon environment, the adventurers' movement happens on a scale of minutes. It takes them about a minute to creep down a long hallway, another minute to check for traps on the door at the end of the hall, and a good ten minutes to search the chamber beyond for anything interesting or valuable.\r\n\r\nIn a city or wilderness, a scale of hours is often more appropriate. Adventurers eager to reach the lonely tower at the heart of the forest hurry across those fifteen miles in just under four hours' time.\r\n\r\nFor long journeys, a scale of days works best. Following the road from Baldur's Gate to Waterdeep, the adventurers spend four uneventful days before a goblin ambush interrupts their journey.\r\n\r\nIn combat and other fast-paced situations, the game relies on rounds, a 6-second span of time.",
        "Name": "Time"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "A creature with blindsight can perceive its surroundings without relying on sight, within a specific radius. Creatures without eyes, such as oozes, and creatures with echolocation or heightened senses, such as bats and true dragons, have this sense.",
            "Name": "Blindsight"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Many creatures in fantasy gaming worlds, especially those that dwell underground, have darkvision. Within a specified range, a creature with darkvision can see in darkness as if the darkness were dim light, so areas of darkness are only lightly obscured as far as that creature is concerned. However, the creature can't discern color in darkness, only shades of gray.",
            "Name": "Darkvision"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "## %{color:steelblue}Tremorsense%\r\nA monster with tremorsense can detect and pinpoint the origin of vibrations within a specific radius, provided that the monster and the source of the vibrations are in contact with the same ground or substance.\r\n\r\nTremorsense can't be used to detect flying or incorporeal creatures. Many burrowing creatures, such as ankhegs, have this special sense.",
            "Name": "Tremorsense"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "A creature with truesight can, out to a specific range, see in normal and magical darkness, see invisible creatures and objects, automatically detect visual illusions and succeed on saving throws against them, and perceives the original form of a shapechanger or a creature that is transformed by magic.\r\n\r\nFurthermore, the creature can see into the Ethereal Plane.",
            "Name": "Truesight"
          }
        ],
        "IsExpanded": false,
        "Markdown": "The most fundamental tasks of adventuring--noticing danger, finding hidden objects, hitting an enemy in combat, and targeting a spell, to name just a few--rely heavily on a character's ability to see. Darkness and other effects that obscure vision can prove a significant hindrance.\r\n\r\nA given area might be lightly or heavily obscured. In a lightly obscured area, such as dim light, patchy fog, or moderate foliage, creatures have disadvantage on Wisdom (Perception) checks that rely on sight.\r\n\r\nA heavily obscured area--such as darkness, opaque fog, or dense foliage--blocks vision entirely. A creature effectively suffers from the blinded condition when trying to see something in that area.\r\n\r\nThe presence or absence of light in an environment creates three categories of illumination: bright light, dim light, and darkness.\r\n\r\nBright light lets most creatures see normally. Even gloomy days provide bright light, as do torches, lanterns, fires, and other sources of illumination within a specific radius.\r\n\r\nDim light, also called shadows, creates a lightly obscured area. An area of dim light is usually a boundary between a source of bright light, such as a torch, and surrounding darkness. The soft light of twilight and dawn also counts as dim light. A particularly brilliant full moon might bathe the land in dim light.\r\n\r\nDarkness creates a heavily obscured area. Characters face darkness outdoors at night (even most moonlit nights), within the confines of an unlit dungeon or a subterranean vault, or in an area of magical darkness.",
        "Name": "Vision and Light"
      }
    ],
    "IsExpanded": false,
    "Markdown": "Delving into the ancient Tomb of Horrors, slipping through the back alleys of Waterdeep, hacking a fresh trail through the thick jungles on the Isle of Dread—these are the things that Dungeons & Dragons adventures are made of. Your character in the game might explore forgotten ruins and uncharted lands, uncover dark secrets and sinister plots, and slay foul monsters. And if all goes well, your character will survive to claim rich rewards before embarking on a new adventure.\r\n\r\nWhether adventurers are exploring a dusty dungeon or the complex relationships of a royal court, the game follows a natural rhythm, as outlined in the book’s introduction:\r\n* The DM describes the environment.\r\n* The players describe what they want to do.\r\n* The DM narrates the results of their actions.\r\n\r\nTypically, the DM uses a map as an outline of the adventure, tracking the characters’ progress as they explore dungeon corridors or wilderness regions. The DM’s notes, including a key to the map, describe what the adventurers find as they enter each new area. Sometimes, the passage of time and the adventurers’ actions determine what happens, so the DM might use a timeline or a flowchart to track their progress instead of a map.",
    "Name": "Adventuring"
  },
  {
    "GlossaryEntries": [
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Initiative determines the order of turns during combat. When combat starts, every participant makes a Dexterity check to determine their place in the initiative order. The DM makes one roll for an entire group of identical creatures, so each member of the group acts at the same time.\r\n\r\nThe DM ranks the combatants in order from the one with the highest Dexterity check total to the one with the lowest. This is the order (called the initiative order) in which they act during each round. The initiative order remains the same from round to round.\r\n\r\nIf a tie occurs, the DM decides the order among tied DM-controlled creatures, and the players decide the order among their tied characters. The DM can decide the order if the tie is between a monster and a player character. Optionally, the DM can have the tied characters and monsters each roll a d20 to determine the order, highest roll going first.",
            "Name": "Initiative"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "A band of adventurers sneaks up on a bandit camp, springing from the trees to attack them. A gelatinous cube glides down a dungeon passage, unnoticed by the adventurers until the cube engulfs one of them. In these situations, one side of the battle gains surprise over the other.\r\n\r\nThe DM determines who might be surprised. If neither side tries to be stealthy, they automatically notice each other. Otherwise, the DM compares the Dexterity (Stealth) checks of anyone hiding with the passive Wisdom (Perception) score of each creature on the opposing side. Any character or monster that doesn't notice a threat is surprised at the start of the encounter.\r\n\r\nIf you're surprised, you can't move or take an action on your first turn of the combat, and you can't take a reaction until that turn ends. A member of a group can be surprised even if the other members aren't.",
            "Name": "Surprise"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "On your turn, you can move a distance up to your speed and take one action. You decide whether to move first or take your action first. Your speed--sometimes called your walking speed--is noted on your character sheet.\r\n\r\nThe most common actions you can take are described in the Actions in Combat section. Many class features and other abilities provide additional options for your action.\r\n\r\nThe Movement and Position section gives the rules for your move.\r\n\r\nYou can forgo moving, taking an action, or doing anything at all on your turn. If you can't decide what to do on your turn, consider taking the Dodge or Ready action, as described in \"Actions in Combat.\"\r\n\r\n## %{color:steelblue}Bonus Actions%\r\nVarious class features, spells, and other abilities let you take an additional action on your turn called a bonus action. The Cunning Action feature, for example, allows a rogue to take a bonus action. You can take a bonus action only when a special ability, spell, or other feature of the game states that you can do something as a bonus action. You otherwise don't have a bonus action to take.\r\n\r\nYou can take only one bonus action on your turn, so you must choose which bonus action to use when you have more than one available.\r\n\r\nYou choose when to take a bonus action during your turn, unless the bonus action's timing is specified, and anything that deprives you of your ability to take actions also prevents you from taking a bonus action.\r\n\r\n## %{color:steelblue}Other Activity on Your Turn%\r\nYour turn can include a variety of flourishes that require neither your action nor your move.\r\n\r\nYou can communicate however you are able, through brief utterances and gestures, as you take your turn.\r\n\r\nYou can also interact with one object or feature of the environment for free, during either your move or your action. For example, you could open a door during your move as you stride toward a foe, or you could draw your weapon as part of the same action you use to attack.\r\n\r\nIf you want to interact with a second object, you need to use your action. Some magic items and other special objects always require an action to use, as stated in their descriptions.\r\n\r\nThe DM might require you to use an action for any of these activities when it needs special care or when it presents an unusual obstacle. For instance, the DM could reasonably expect you to use an action to open a stuck door or turn a crank to lower a drawbridge.\r\n\r\n## %{color:steelblue}Reactions%\r\nCertain special abilities, spells, and situations allow you to take a special action called a reaction. A reaction is an instant response to a trigger of some kind, which can occur on your turn or on someone else's. The opportunity attack, described later in this section, is the most common type of reaction.\r\n\r\nWhen you take a reaction, you can't take another one until the start of your next turn. If the reaction interrupts another creature's turn, that creature can continue its turn right after the reaction.",
            "Name": "Your Turn"
          }
        ],
        "IsExpanded": false,
        "Markdown": "A typical combat encounter is a clash between two sides, a flurry of weapon swings, feints, parries, footwork, and spellcasting. The game organizes the chaos of combat into a cycle of rounds and turns. A round represents about 6 seconds in the game world. During a round, each participant in a battle takes a turn. The order of turns is determined at the beginning of a combat encounter, when everyone rolls initiative. Once everyone has taken a turn, the fight continues to the next round if neither side has defeated the other.",
        "Name": "Order of Combat"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "You can break up your movement on your turn, using some of your speed before and after your action. For example, if you have a speed of 30 feet, you can move 10 feet, take your action, and then move 20 feet.\r\n\r\n## %{color:steelblue}Moving Between Attacks%\r\nIf you take an action that includes more than one weapon attack, you can break up your movement even further by moving between those attacks. For example, a fighter who can make two attacks with the Extra Attack feature and who has a speed of 25 feet could move 10 feet, make an attack, move 15 feet, and then attack again.\r\n\r\n## %{color:steelblue}Using Different Speeds%\r\nIf you have more than one speed, such as your walking speed and a flying speed, you can switch back and forth between your speeds during your move. Whenever you switch, subtract the distance you've already moved from the new speed. The result determines how much farther you can move. If the result is 0 or less, you can't use the new speed during the current move.\r\n\r\nFor example, if you have a speed of 30 and a flying speed of 60 because a wizard cast the fly spell on you, you could fly 20 feet, then walk 10 feet, and then leap into the air to fly 30 feet more.",
            "Name": "Breaking Up Your Move"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Combat rarely takes place in bare rooms or on featureless plains. Boulder-strewn caverns, briar-choked forests, treacherous staircases--the setting of a typical fight contains difficult terrain.\r\n\r\nEvery foot of movement in difficult terrain costs 1 extra foot. This rule is true even if multiple things in a space count as difficult terrain.\r\n\r\nLow furniture, rubble, undergrowth, steep stairs, snow, and shallow bogs are examples of difficult terrain. The space of another creature, whether hostile or not, also counts as difficult terrain.",
            "Name": "Difficult Terrain"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Combatants often find themselves lying on the ground, either because they are knocked down or because they throw themselves down. In the game, they are prone. You can drop prone without using any of your speed. Standing up takes more effort; doing so costs an amount of movement equal to half your speed. For example, if your speed is 30 feet, you must spend 15 feet of movement to stand up. You can't stand up if you don't have enough movement left or if your speed is 0.\r\n\r\nTo move while prone, you must crawl or use magic such as teleportation. Every foot of movement while crawling costs 1 extra foot. Crawling 1 foot in difficult terrain, therefore, costs 3 feet of movement.",
            "Name": "Being Prone"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Each creature takes up a different amount of space. The Size Categories table shows how much space a creature of a particular size controls in combat. Objects sometimes use the same size categories.\r\n\r\n## %{color:steelblue}Space%\r\nA creature's space is the area in feet that it effectively controls in combat, not an expression of its physical dimensions. A typical Medium creature isn't 5 feet wide, for example, but it does control a space that wide. If a Medium hobgoblin stands in a 5‐foot-wide doorway, other creatures can't get through unless the hobgoblin lets them.\r\n\r\nA creature's space also reflects the area it needs to fight effectively. For that reason, there's a limit to the number of creatures that can surround another creature in combat. Assuming Medium combatants, eight creatures can fit in a 5-foot radius around another one.\r\n\r\nBecause larger creatures take up more space, fewer of them can surround a creature. If four Large creatures crowd around a Medium or smaller one, there's little room for anyone else. In contrast, as many as twenty Medium creatures can surround a Gargantuan one.\r\n\r\n## %{color:steelblue}Squeezing into a Smaller Space%\r\nA creature can squeeze through a space that is large enough for a creature one size smaller than it. Thus, a Large creature can squeeze through a passage that's only 5 feet wide. While squeezing through a space, a creature must spend 1 extra foot for every foot it moves there, and it has disadvantage on attack rolls and Dexterity saving throws. Attack rolls against the creature have advantage while it's in the smaller space.",
            "Name": "Creature Size"
          }
        ],
        "IsExpanded": false,
        "Markdown": "In combat, characters and monsters are in constant motion, often using movement and position to gain the upper hand.\r\n\r\nOn your turn, you can move a distance up to your speed. You can use as much or as little of your speed as you like on your turn, following the rules here.\r\n\r\nYour movement can include jumping, climbing, and swimming. These different modes of movement can be combined with walking, or they can constitute your entire move. However you're moving, you deduct the distance of each part of your move from your speed until it is used up or until you are done moving.\r\n\r\nYou can move through a nonhostile creature's space. In contrast, you can move through a hostile creature's space only if the creature is at least two sizes larger or smaller than you. Remember that another creature's space is difficult terrain for you.\r\n\r\nWhether a creature is a friend or an enemy, you can't willingly end your move in its space.\r\n\r\nIf you leave a hostile creature's reach during your move, you provoke an opportunity attack, as explained later in the section.",
        "Name": "Movement and Position"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "The most common action to take in combat is the Attack action, whether you are swinging a sword, firing an arrow from a bow, or brawling with your fists.\r\n\r\nWith this action, you make one melee or ranged attack. See the \"Making an Attack\" section for the rules that govern attacks.\r\n\r\nCertain features, such as the Extra Attack feature of the fighter, allow you to make more than one attack with this action.",
            "Name": "Attack"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Spellcasters such as wizards and clerics, as well as many monsters, have access to spells and can use them to great effect in combat. Each spell has a casting time, which specifies whether the caster must use an action, a reaction, minutes, or even hours to cast the spell. Casting a spell is, therefore, not necessarily an action. Most spells do have a casting time of 1 action, so a spellcaster often uses his or her action in combat to cast such a spell.",
            "Name": "Cast a Spell"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you take the Dash action, you gain extra movement for the current turn. The increase equals your speed, after applying any modifiers. With a speed of 30 feet, for example, you can move up to 60 feet on your turn if you dash.\r\n\r\nAny increase or decrease to your speed changes this additional movement by the same amount. If your speed of 30 feet is reduced to 15 feet, for instance, you can move up to 30 feet this turn if you dash.",
            "Name": "Dash"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "If you take the Disengage action, your movement doesn't provoke opportunity attacks for the rest of the turn.",
            "Name": "Disengage"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any attack roll made against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage. You lose this benefit if you are incapacitated or if your speed drops to 0.",
            "Name": "Dodge"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "You can lend your aid to another creature in the completion of a task. When you take the Help action, the creature you aid gains advantage on the next ability check it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn.\r\n\r\nAlternatively, you can aid a friendly creature in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your ally's attack more effective. If your ally attacks the target before your next turn, the first attack roll is made with advantage.",
            "Name": "Help"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you take the Hide action, you make a Dexterity (Stealth) check in an attempt to hide, following the rules for hiding. If you succeed, you gain certain benefits, as described in the \"Unseen Attackers and Targets\" section later in this section.\r\n\r\nYou can't hide from a creature that can see you clearly, and you give away your position if you make noise, such as shouting a warning or knocking over a vase. An invisible creature can always try to hide. Signs of its passage might still be noticed, and it does have to stay quiet.\r\n\r\nIn combat, most creatures stay alert for signs of danger all around, so if you come out of hiding and approach a creature, it usually sees you. However, under certain circumstances, the DM might allow you to stay hidden as you approach a creature that is distracted, allowing you to gain advantage on an attack roll before you are seen.\r\n\r\n__Passive Perception.__ When you hide, there's a chance someone will notice you even if they aren't searching. To determine whether such a creature notices you, the DM compares your Dexterity (Stealth) check with that creature's passive Wisdom (Perception) score, which equals 10 + the creature's Wisdom modifier, as well as any other bonuses or penalties. If the creature has advantage, add 5. For disadvantage, subtract 5.\r\n\r\nFor example, if a 1st-level character (with a proficiency bonus of +2) has a Wisdom of 15 (a +2 modifier) and proficiency in Perception, he or she has a passive Wisdom (Perception) of 14.\r\n\r\n__What Can You See?__ One of the main factors in determining whether you can find a hidden creature or object is how well you can see in an area, which might be lightly or heavily obscured as explained in chapter 8, “Adventuring.”",
            "Name": "Hide"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Sometimes you want to get the jump on a foe or wait for a particular circumstance before you act. To do so, you can take the Ready action on your turn, which lets you act using your reaction before the start of your next turn.\r\n\r\nFirst, you decide what perceivable circumstance will trigger your reaction. Then, you choose the action you will take in response to that trigger, or you choose to move up to your speed in response to it. Examples include \"If the cultist steps on the trapdoor, I'll pull the lever that opens it,\" and \"If the goblin steps next to me, I move away.\"\r\n\r\nWhen the trigger occurs, you can either take your reaction right after the trigger finishes or ignore the trigger. Remember that you can take only one reaction per round.\r\n\r\nWhen you ready a spell, you cast it as normal but hold its energy, which you release with your reaction when the trigger occurs. To be readied, a spell must have a casting time of 1 action, and holding onto the spell's magic requires concentration. If your concentration is broken, the spell dissipates without taking effect. For example, if you are concentrating on the web spell and ready magic missile, your web spell ends, and if you take damage before you release magic missile with your reaction, your concentration might be broken.",
            "Name": "Ready"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When your character searches for a hidden object such as a secret door or a trap, the DM typically asks you to make a Wisdom (Perception) check. Such a check can be used to find hidden details or other information and clues that you might otherwise overlook.\r\n\r\nIn most cases, you need to describe where you are looking in order for the DM to determine your chance of success. For example, a key is hidden beneath a set of folded clothes in the top drawer of a bureau. If you tell the DM that you pace around the room, looking at the walls and furniture for clues, you have no chance of finding the key, regardless of your Wisdom (Perception) check result. You would have to specify that you were opening the drawers or searching the bureau in order to have any chance of success.",
            "Name": "Search"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "You normally interact with an object while doing something else, such as when you draw a sword as part of an attack. When an object requires your action for its use, you take the Use an Object action. This action is also useful when you want to interact with more than one object on your turn.\r\n\r\n## %{color:steelblue}Improvising an Action%\r\nYour character can do things not covered by the actions in this section, such as breaking down doors, intimidating enemies, sensing weaknesses in magical defenses, or calling for a parley with a foe. The only limits to the actions you can attempt are your imagination and your character’s ability scores. See the descriptions of the ability scores in the Using Ability Scores section for inspiration as you improvise.\r\n\r\nWhen you describe an action not detailed elsewhere in the rules, the DM tells you whether that action is possible and what kind of roll you need to make, if any, to determine success or failure.",
            "Name": "Use an Object"
          }
        ],
        "IsExpanded": false,
        "Markdown": "When you take your action on your turn, you can take one of the actions presented here, an action you gained from your class or a special feature, or an action that you improvise. Many monsters have action options of their own in their stat blocks.\r\n\r\nWhen you describe an action not detailed elsewhere in the rules, the DM tells you whether that action is possible and what kind of roll you need to make, if any, to determine success or failure.",
        "Name": "Actions"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you make an attack, your attack roll determines whether the attack hits or misses. To make an attack roll, roll a d20 and add the appropriate modifiers. If the total of the roll plus modifiers equals or exceeds the target's Armor Class (AC), the attack hits. The AC of a character is determined at character creation, whereas the AC of a monster is in its stat block.\r\n\r\n## %{color:steelblue}Modifiers to the Roll%\r\nWhen a character makes an attack roll, the two most common modifiers to the roll are an ability modifier and the character's proficiency bonus. When a monster makes an attack roll, it uses whatever modifier is provided in its stat block.\r\n\r\n* The ability modifier used for a melee weapon attack is Strength, and the ability modifier used for a ranged weapon attack is Dexterity. Weapons that have the finesse or thrown property break this rule.\r\n* Some spells also require an attack roll. The ability modifier used for a spell attack depends on the spellcasting ability of the spellcaster.\r\n* You add your proficiency bonus to your attack roll when you attack using a weapon with which you have proficiency, as well as when you attack with a spell.\r\n\r\n## %{color:steelblue}Rolling 1 or 20%\r\nSometimes fate blesses or curses a combatant, causing the novice to hit and the veteran to miss.\r\n\r\nIf the d20 roll for an attack is a 20, the attack hits regardless of any modifiers or the target's AC. This is called a critical hit, which is explained later in this section.\r\n\r\nIf the d20 roll for an attack is a 1, the attack misses regardless of any modifiers or the target's AC.",
            "Name": "Attack Rolls"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Used in hand-to-hand combat, a melee attack allows you to attack a foe within your reach. A melee attack typically uses a handheld weapon such as a sword, a warhammer, or an axe. A typical monster makes a melee attack when it strikes with its claws, horns, teeth, tentacles, or other body part. A few spells also involve making a melee attack.\r\n\r\nMost creatures have a 5-foot reach and can thus attack targets within 5 feet of them when making a melee attack. Certain creatures (typically those larger than Medium) have melee attacks with a greater reach than 5 feet, as noted in their descriptions.\r\n\r\nInstead of using a weapon to make a melee weapon attack, you can use an unarmed strike: a punch, kick, head-butt, or similar forceful blow (none of which count as weapons). On a hit, an unarmed strike deals bludgeoning damage equal to 1 + your Strength modifier. You are proficient with your unarmed strikes.\r\n\r\n## %{color:steelblue}Opportunity Attacks%\r\nIn a fight, everyone is constantly watching for a chance to strike an enemy who is fleeing or passing by. Such a strike is called an opportunity attack.\r\n\r\nYou can make an opportunity attack when a hostile creature that you can see moves out of your reach. To make the opportunity attack, you use your reaction to make one melee attack against the provoking creature. The attack occurs right before the creature leaves your reach.\r\n\r\nYou can avoid provoking an opportunity attack by taking the Disengage action. You also don't provoke an opportunity attack when you teleport or when someone or something moves you without using your movement, action, or reaction. For example, you don't provoke an opportunity attack if an explosion hurls you out of a foe's reach or if gravity causes you to fall past an enemy.\r\n\r\n## %{color:steelblue}Two-Weapon Fighting%\r\nWhen you take the Attack action and attack with a light melee weapon that you're holding in one hand, you can use a bonus action to attack with a different light melee weapon that you're holding in the other hand. You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative.\r\n\r\nIf either weapon has the thrown property, you can throw the weapon, instead of making a melee attack with it.\r\n\r\n## %{color:steelblue}Grappling%\r\nWhen you want to grab a creature or wrestle with it, you can use the Attack action to make a special melee attack, a grapple. If you're able to make multiple attacks with the Attack action, this attack replaces one of them.\r\n\r\nThe target of your grapple must be no more than one size larger than you and must be within your reach. Using at least one free hand, you try to seize the target by making a grapple check instead of an attack roll: a Strength (Athletics) check contested by the target's Strength (Athletics) or Dexterity (Acrobatics) check (the target chooses the ability to use). You succeed automatically if the target is incapacitated. If you succeed, you subject the target to the grappled condition. The condition specifies the things that end it, and you can release the target whenever you like (no action required).\r\n\r\n**Escaping a Grapple** A grappled creature can use its action to escape. To do so, it must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check contested by your Strength (Athletics) check.\r\n\r\n**Moving a Grappled Creature** When you move, you can drag or carry the grappled creature with you, but your speed is halved, unless the creature is two or more sizes smaller than you.\r\n\r\n## %{color:steelblue}Shoving a Creature%\r\nUsing the Attack action, you can make a special melee attack to shove a creature, either to knock it prone or push it away from you. If you're able to make multiple attacks with the Attack action, this attack replaces one of them.\r\n\r\nThe target must be no more than one size larger than you and must be within your reach. Instead of making an attack roll, you make a Strength (Athletics) check contested by the target's Strength (Athletics) or Dexterity (Acrobatics) check (the target chooses the ability to use). You succeed automatically if the target is incapacitated. If you succeed, you either knock the target prone or push it 5 feet away from you.",
            "Name": "Melee Attacks"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you make a ranged attack, you fire a bow or a crossbow, hurl a handaxe, or otherwise send projectiles to strike a foe at a distance. A monster might shoot spines from its tail. Many spells also involve making a ranged attack.\r\n\r\n## %{color:steelblue}Range%\r\nYou can make ranged attacks only against targets within a specified range.\r\n\r\nIf a ranged attack, such as one made with a spell, has a single range, you can't attack a target beyond this range.\r\n\r\nSome ranged attacks, such as those made with a longbow or a shortbow, have two ranges. The smaller number is the normal range, and the larger number is the long range. Your attack roll has disadvantage when your target is beyond normal range, and you can't attack a target beyond the long range.\r\n\r\n## %{color:steelblue}Ranged Attacks in Close Combat%\r\nAiming a ranged attack is more difficult when a foe is next to you. When you make a ranged attack with a weapon, a spell, or some other means, you have disadvantage on the attack roll if you are within 5 feet of a hostile creature who can see you and who isn't incapacitated.",
            "Name": "Ranged Attacks"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Combatants often try to escape their foes' notice by hiding, casting the invisibility spell, or lurking in darkness.\r\n\r\nWhen you attack a target that you can't see, you have disadvantage on the attack roll. This is true whether you're guessing the target's location or you're targeting a creature you can hear but not see. If the target isn't in the location you targeted, you automatically miss, but the DM typically just says that the attack missed, not whether you guessed the target's location correctly.\r\n\r\nWhen a creature can't see you, you have advantage on attack rolls against it. If you are hidden--both unseen and unheard--when you make an attack, you give away your location when the attack hits or misses.",
            "Name": "Unseen Attackers and Targets"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Whether you're striking with a melee weapon, firing a weapon at range, or making an attack roll as part of a spell, an attack has a simple structure.\r\n\r\n* Choose a target. Pick a target within your attack's range: a creature, an object, or a location.\r\n* Determine modifiers. The DM determines whether the target has cover and whether you have advantage or disadvantage against the target. In addition, spells, special abilities, and other effects can apply penalties or bonuses to your attack roll.\r\n* Resolve the attack. You make the attack roll. On a hit, you roll damage, unless the particular attack has rules that specify otherwise. Some attacks cause special effects in addition to or instead of damage.\r\n\r\nIf there's ever any question whether something you're doing counts as an attack, the rule is simple: if you're making an attack roll, you're making an attack.",
        "Name": "Making an Attack"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Walls, trees, creatures, and other obstacles can provide cover during combat, making a target more difficult to harm. A target can benefit from cover only when an attack or other effect originates on the opposite side of the cover.\r\n\r\nThere are three degrees of cover. If a target is behind multiple sources of cover, only the most protective degree of cover applies; the degrees aren't added together. For example, if a target is behind a creature that gives half cover and a tree trunk that gives three-quarters cover, the target has three-quarters cover.\r\n\r\n## %{color:steelblue}Half Cover%\r\nA target with half cover has a +2 bonus to AC and Dexterity saving throws. A target has half cover if an obstacle blocks at least half of its body. The obstacle might be a low wall, a large piece of furniture, a narrow tree trunk, or a creature, whether that creature is an enemy or a friend.\r\n\r\n## %{color:steelblue}Three-Quarters Cover%\r\nA target with three-quarters cover has a +5 bonus to AC and Dexterity saving throws. A target has three-quarters cover if about three-quarters of it is covered by an obstacle. The obstacle might be a portcullis, an arrow slit, or a thick tree trunk.\r\n\r\n## %{color:steelblue}Total Cover%\r\nA target with total cover can't be targeted directly by an attack or a spell, although some spells can reach such a target by including it in an area of effect. A target has total cover if it is completely concealed by an obstacle.",
        "Name": "Cover"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Hit points represent a combination of physical and mental durability, the will to live, and luck. Creatures with more hit points are more difficult to kill. Those with fewer hit points are more fragile.\r\n\r\nA creature's current hit points (usually just called hit points) can be any number from the creature's hit point maximum down to 0. This number changes frequently as a creature takes damage or receives healing.\r\n\r\nWhenever a creature takes damage, that damage is subtracted from its hit points. The loss of hit points has no effect on a creature's capabilities until the creature drops to 0 hit points.",
            "Name": "Hit Points"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Each weapon, spell, and harmful monster ability specifies the damage it deals. You roll the damage die or dice, add any modifiers, and apply the damage to your target. Magic weapons, special abilities, and other factors can grant a bonus to damage.\r\n\r\nWith a penalty, it is possible to deal 0 damage, but never negative damage.\r\n\r\nWhen attacking with a weapon, you add your ability modifier--the same modifier used for the attack roll--to the damage. A spell tells you which dice to roll for damage and whether to add any modifiers.\r\n\r\nIf a spell or other effect deals damage to more than one target at the same time, roll the damage once for all of them. For example, when a wizard casts fireball or a cleric casts flame strike, the spell's damage is rolled once for all creatures caught in the blast.\r\n\r\n## %{color:steelblue}Critical Hits%\r\nWhen you score a critical hit, you get to roll extra dice for the attack's damage against the target. Roll all of the attack's damage dice twice and add them together. Then add any relevant modifiers as normal. To speed up play, you can roll all the damage dice at once.\r\n\r\nFor example, if you score a critical hit with a dagger, roll 2d4 for the damage, rather than 1d4, and then add your relevant ability modifier. If the attack involves other damage dice, such as from the rogue's Sneak Attack feature, you roll those dice twice as well.",
            "Name": "Damage Rolls"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Different attacks, damaging spells, and other harmful effects deal different types of damage. Damage types have no rules of their own, but other rules, such as damage resistance, rely on the types.\r\n\r\nThe damage types follow, with examples to help a DM assign a damage type to a new effect.\r\n\r\n**Acid** The corrosive spray of an adult black dragon's breath and the dissolving enzymes secreted by a black pudding deal acid damage.\r\n\r\n**Bludgeoning** Blunt force attacks--hammers, falling, constriction, and the like--deal bludgeoning damage.\r\n\r\n**Cold** The infernal chill radiating from an ice devil's spear and the frigid blast of a young white dragon's breath deal cold damage.\r\n\r\n**Fire** Ancient red dragons breathe fire, and many spells conjure flames to deal fire damage.\r\n\r\n**Force** Force is pure magical energy focused into a damaging form. Most effects that deal force damage are spells, including magic missile and spiritual weapon.\r\n\r\n**Lightning** A lightning bolt spell and a blue dragon wyrmling's breath deal lightning damage.\r\n\r\n**Necrotic** Necrotic damage, dealt by certain undead and a spell such as chill touch, withers matter and even the soul.\r\n\r\n**Piercing** Puncturing and impaling attacks, including spears and monsters' bites, deal piercing damage.\r\n\r\n**Poison** Venomous stings and the toxic gas of an adult green dragon's breath deal poison damage.\r\n\r\n**Psychic** Mental abilities such as a psionic blast deal psychic damage.\r\n\r\n**Radiant** Radiant damage, dealt by a cleric's flame strike spell or an angel's smiting weapon, sears the flesh like fire and overloads the spirit with power.\r\n\r\n**Slashing** Swords, axes, and monsters' claws deal slashing damage.\r\n\r\n**Thunder** A concussive burst of sound, such as the effect of the thunderwave spell, deals thunder damage.",
            "Name": "Damage Types"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Some creatures and objects are exceedingly difficult or unusually easy to hurt with certain types of damage.\r\n\r\nIf a creature or an object has resistance to a damage type, damage of that type is halved against it. If a creature or an object has vulnerability to a damage type, damage of that type is doubled against it.\r\n\r\nResistance and then vulnerability are applied after all other modifiers to damage. For example, a creature has resistance to bludgeoning damage and is hit by an attack that deals 25 bludgeoning damage. The creature is also within a magical aura that reduces all damage by 5. The 25 damage is first reduced by 5 and then halved, so the creature takes 10 damage.\r\n\r\nMultiple instances of resistance or vulnerability that affect the same damage type count as only one instance. For example, if a creature has resistance to fire damage as well as resistance to all nonmagical damage, the damage of a nonmagical fire is reduced by half against the creature, not reduced by three-quarters.",
            "Name": "Resistance and Vulnerability"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Unless it results in death, damage isn't permanent. Even death is reversible through powerful magic. Rest can restore a creature's hit points, and magical methods such as a cure wounds spell or a potion of healing can remove damage in an instant.\r\n\r\nWhen a creature receives healing of any kind, hit points regained are added to its current hit points. A creature's hit points can't exceed its hit point maximum, so any hit points regained in excess of this number are lost. For example, a druid grants a ranger 8 hit points of healing. If the ranger has 14 current hit points and has a hit point maximum of 20, the ranger regains 6 hit points from the druid, not 8.\r\n\r\nA creature that has died can't regain hit points until magic such as the revivify spell has restored it to life.",
            "Name": "Healing"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When you drop to 0 hit points, you either die outright or fall unconscious, as explained in the following sections.\r\n\r\n## %{color:steelblue}Instant Death%\r\nMassive damage can kill you instantly. When damage reduces you to 0 hit points and there is damage remaining, you die if the remaining damage equals or exceeds your hit point maximum.\r\n\r\nFor example, a cleric with a maximum of 12 hit points currently has 6 hit points. If she takes 18 damage from an attack, she is reduced to 0 hit points, but 12 damage remains. Because the remaining damage equals her hit point maximum, the cleric dies.\r\n\r\n## %{color:steelblue}Falling Unconscious%\r\nIf damage reduces you to 0 hit points and fails to kill you, you fall unconscious. This unconsciousness ends if you regain any hit points.\r\n\r\n## %{color:steelblue}Death Saving Throws%\r\nWhenever you start your turn with 0 hit points, you must make a special saving throw, called a death saving throw, to determine whether you creep closer to death or hang onto life. Unlike other saving throws, this one isn't tied to any ability score. You are in the hands of fate now, aided only by spells and features that improve your chances of succeeding on a saving throw.\r\n\r\nRoll a d20. If the roll is 10 or higher, you succeed. Otherwise, you fail. A success or failure has no effect by itself. On your third success, you become stable (see below). On your third failure, you die. The successes and failures don't need to be consecutive; keep track of both until you collect three of a kind. The number of both is reset to zero when you regain any hit points or become stable.\r\n\r\n**Rolling 1 or 20** When you make a death saving throw and roll a 1 on the d20, it counts as two failures. If you roll a 20 on the d20, you regain 1 hit point.\r\n\r\n**Damage at 0 Hit Points** If you take any damage while you have 0 hit points, you suffer a death saving throw failure. If the damage is from a critical hit, you suffer two failures instead. If the damage equals or exceeds your hit point maximum, you suffer instant death.\r\n\r\n## %{color:steelblue}Stabilizing a Creature%\r\nThe best way to save a creature with 0 hit points is to heal it. If healing is unavailable, the creature can at least be stabilized so that it isn't killed by a failed death saving throw.\r\n\r\nYou can use your action to administer first aid to an unconscious creature and attempt to stabilize it, which requires a successful DC 10 Wisdom (Medicine) check.\r\n\r\nA stable creature doesn't make death saving throws, even though it has 0 hit points, but it does remain unconscious. The creature stops being stable, and must start making death saving throws again, if it takes any damage. A stable creature that isn't healed regains 1 hit point after 1d4 hours.\r\n\r\n## %{color:steelblue}Monsters and Death%\r\nMost DMs have a monster die the instant it drops to 0 hit points, rather than having it fall unconscious and make death saving throws.\r\n\r\nMighty villains and special nonplayer characters are common exceptions; the DM might have them fall unconscious and follow the same rules as player characters.",
            "Name": "Dropping to 0 Hit Points"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Sometimes an attacker wants to incapacitate a foe, rather than deal a killing blow. When an attacker reduces a creature to 0 hit points with a melee attack, the attacker can knock the creature out. The attacker can make this choice the instant the damage is dealt. The creature falls unconscious and is stable.",
            "Name": "Knocking a Creature Out"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Some spells and special abilities confer temporary hit points to a creature. Temporary hit points aren't actual hit points; they are a buffer against damage, a pool of hit points that protect you from injury.\r\n\r\nWhen you have temporary hit points and take damage, the temporary hit points are lost first, and any leftover damage carries over to your normal hit points. For example, if you have 5 temporary hit points and take 7 damage, you lose the temporary hit points and then take 2 damage.\r\n\r\nBecause temporary hit points are separate from your actual hit points, they can exceed your hit point maximum. A character can, therefore, be at full hit points and receive temporary hit points.\r\n\r\nHealing can't restore temporary hit points, and they can't be added together. If you have temporary hit points and receive more of them, you decide whether to keep the ones you have or to gain the new ones. For example, if a spell grants you 12 temporary hit points when you already have 10, you can have 12 or 10, not 22.\r\n\r\nIf you have 0 hit points, receiving temporary hit points doesn't restore you to consciousness or stabilize you. They can still absorb damage directed at you while you're in that state, but only true healing can save you.\r\nUnless a feature that grants you temporary hit points has a duration, they last until they're depleted or you finish a long rest.",
            "Name": "Temporary Hit Points"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Injury and the risk of death are constant companions of those who explore fantasy gaming worlds. The thrust of a sword, a well-placed arrow, or a blast of flame from a fireball spell all have the potential to damage, or even kill, the hardiest of creatures.",
        "Name": "Damage and Healing"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "A knight charging into battle on a warhorse, a wizard casting spells from the back of a griffon, or a cleric soaring through the sky on a pegasus all enjoy the benefits of speed and mobility that a mount can provide.\r\n\r\nA willing creature that is at least one size larger than you and that has an appropriate anatomy can serve as a mount, using the following rules.\r\n\r\n## %{color:steelblue}Mounting and Dismounting%\r\nOnce during your move, you can mount a creature that is within 5 feet of you or dismount. Doing so costs an amount of movement equal to half your speed. For example, if your speed is 30 feet, you must spend 15 feet of movement to mount a horse. Therefore, you can’t mount it if you don’t have 15 feet of movement left or if your speed is 0.\r\n\r\nIf an effect moves your mount against its will while you’re on it, you must succeed on a DC 10 Dexterity saving throw or fall off the mount, landing prone in a space within 5 feet of it. If you’re knocked prone while mounted, you must make the same saving throw.\r\n\r\nIf your mount is knocked prone, you can use your reaction to dismount it as it falls and land on your feet. Otherwise, you are dismounted and fall prone in a space within 5 feet it.\r\n\r\n## %{color:steelblue}Controlling a Mount%\r\nWhile you’re mounted, you have two options. You can either control the mount or allow it to act independently. Intelligent creatures, such as dragons, act independently.\r\n\r\nYou can control a mount only if it has been trained to accept a rider. Domesticated horses, donkeys, and similar creatures are assumed to have such training. The initiative of a controlled mount changes to match yours when you mount it. It moves as you direct it, and it has only three action options: Dash, Disengage, and Dodge. A controlled mount can move and act even on the turn that you mount it.\r\n\r\nAn independent mount retains its place in the initiative order. Bearing a rider puts no restrictions on the actions the mount can take, and it moves and acts as it wishes. It might flee from combat, rush to attack and devour a badly injured foe, or otherwise act against your wishes.\r\n\r\nIn either case, if the mount provokes an opportunity attack while you’re on it, the attacker can target you or the mount.",
        "Name": "Mounted Combat"
      }
    ],
    "IsExpanded": false,
    "Markdown": "The clatter of a sword striking against a shield. The terrible rending sound as monstrous claws tear through armor. A brilliant flash of light as a ball of flame blossoms from a wizard’s spell. The sharp tang of blood in the air, cutting through the stench of vile monsters. Roars of fury, shouts of triumph, cries of pain. Combat in D&D can be chaotic, deadly, and thrilling.\r\n\r\nThis section provides the rules you need for your characters and monsters to engage in combat, whether it is a brief skirmish or an extended conflict in a dungeon or on a field of battle. Throughout this section, the rules address you, the player or Dungeon Master. The Dungeon Master controls all the monsters and nonplayer characters involved in combat, and each other player controls an adventurer. “You” can also mean the character or monster that you control.",
    "Name": "Combat"
  },
  {
    "GlossaryEntries": [
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Made from supple and thin materials, light armor favors agile adventurers since it offers some protection without sacrificing mobility. If you wear light armor, you add your Dexterity modifier to the base number from your armor type to determine your Armor Class.\r\n\r\n* Padded armor consists of quilted layers of cloth and batting.\r\n* The breastplate and shoulder protectors of this armor are made of leather that has been stiffened by being boiled in oil. The rest of the armor is made of softer and more flexible materials.\r\n* Made from tough but flexible leather, studded leather is reinforced with close-set rivets or spikes.",
            "Name": "Light"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Medium armor offers more protection than light armor, but it also impairs movement more. If you wear medium armor, you add your Dexterity modifier, to a maximum of +2, to the base number from your armor type to determine your Armor Class.\r\n\r\n* Hide armor consists of thick furs and pelts. It is commonly worn by barbarian tribes, evil humanoids, and other folk who lack access to the tools and materials needed to create better armor.\r\n* Chain Shirts are made of interlocking metal rings, a chain shirt is worn between layers of clothing or leather. This armor offers modest protection to the wearer's upper body and allows the sound of the rings rubbing against one another to be muffled by outer layers.\r\n* Scale Mail consists of a coat and leggings (and perhaps a separate skirt) of leather covered with overlapping pieces of metal, much like the scales of a fish. The suit includes gauntlets.\r\n* Breastplate consists of a fitted metal chest piece worn with supple leather. Although it leaves the legs and arms relatively unprotected, this armor provides good protection for the wearer's vital organs while leaving the wearer relatively unencumbered.\r\n* Half plate consists of shaped metal plates that cover most of the wearer's body. It does not include leg protection beyond simple greaves that are attached with leather straps.",
            "Name": "Medium"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Of all the armor categories, heavy armor offers the best protection. These suits of armor cover the entire body and are designed to stop a wide range of attacks. Only proficient warriors can manage their weight and bulk.\r\n\r\nHeavy armor doesn't let you add your Dexterity modifier to your Armor Class, but it also doesn't penalize you if your Dexterity modifier is negative.\r\n\r\n* Ring Mail is leather armor with heavy rings sewn into it. The rings help reinforce the armor against blows from swords and axes. Ring mail is inferior to chain mail, and it's usually worn only by those who can't afford better armor.\r\n* Chain Mail is made of interlocking metal rings, chain mail includes a layer of quilted fabric worn underneath the mail to prevent chafing and to cushion the impact of blows. The suit includes gauntlets.\r\n* Splint armor is made of narrow vertical strips of metal riveted to a backing of leather that is worn over cloth padding. Flexible chain mail protects the joints.\r\n* Plate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.",
            "Name": "Heavy"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Adventurers have access to a variety of armor types, ranging from leather armor to chain mail to costly plate armor, with several other kinds of armor in between. The Armor table collects the most commonly available types of armor found in the game and separates them into three categories: light armor, medium armor, and heavy armor. Many warriors supplement their armor with a shield.\r\n\r\nThe Armor table shows the cost, weight, and other properties of the common types of armor and shields used in the worlds of D&D.\r\n\r\n## %{color:steelblue}Armor Proficiency% \r\nAnyone can put on a suit of armor or strap a shield to an arm. Only those proficient in the armor's use know how to wear it effectively, however. Your class gives you proficiency with certain types of armor. If you wear armor that you lack proficiency with, you have disadvantage on any ability check, saving throw, or attack roll that involves Strength or Dexterity, and you can't cast spells.\r\n\r\n## %{color:steelblue}Armor Class (AC)% \r\nYour Armor Class (AC) represents how well your character avoids being wounded in battle. Things that contribute to your AC include the armor you wear, the shield you carry, and your Dexterity modifier. Not all characters wear armor or carry shields, however. Without armor or a shield, your character’s AC equals 10 + his or her Dexterity modifier. If your character wears armor, carries a shield, or both, calculate your AC using the rules in the Equipment section.\r\n\r\n## %{color:steelblue}Heavy Armor% \r\nHeavier armor interferes with the wearer's ability to move quickly, stealthily, and freely. If the Armor table shows \"Str 13\" or \"Str 15\" in the Strength column for an armor type, the armor reduces the wearer's speed by 10 feet unless the wearer has a Strength score equal to or higher than the listed score.\r\n\r\n## %{color:steelblue}Stealth% \r\nIf the Armor table shows \"Disadvantage\" in the Stealth column, the wearer has disadvantage on Dexterity (Stealth) checks.\r\n\r\n## %{color:steelblue}Shields% \r\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.\r\n\r\nThe time it takes to don or doff a type of armor or a shield is shown in the Donning and Doffing Armor table.\r\n\r\n__Don__ This is the time it takes to put on the item. You benefit from its AC only if you take the full time to don it.\r\n__Doff__ This is the time it takes to take off the item. If you have help removing armor, reduce this time by half.",
        "Name": "Armor"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "A good mount can help you move more quickly through the wilderness, but its primary purpose is to carry the gear that would otherwise slow you down. The Mounts and Other Animals table shows each animal’s speed and base carrying capacity.\r\n\r\nAn animal pulling a carriage, cart, chariot, sled, or wagon can move weight up to five times its base carrying capacity, including the weight of the vehicle. If multiple animals pull the same vehicle, they can add their carrying capacity together.\r\n\r\nMounts other than those listed here are available in fantasy gaming worlds, but they are rare and not normally available for purchase. These include flying mounts (pegasi, griffons, hippogriffs, and similar animals) and even aquatic mounts (giant sea horses, for example). Acquiring such a mount often means securing an egg and raising the creature yourself, making a bargain with a powerful entity, or negotiating with the mount itself.\r\n\r\n**Barding** Barding is armor designed to protect an animal’s head, neck, chest, and body. Any type of armor shown on the Armor table can be purchased as barding. The cost is four times the equivalent armor made for humanoids, and it weighs twice as much.\r\n\r\n**Saddles** A military saddle braces the rider, helping you keep your seat on an active mount in battle. It gives you advantage on any check you make to remain mounted. An exotic saddle is required for riding any aquatic or flying mount.\r\n\r\n**Vehicle Proficiency** If you have proficiency with a certain kind of vehicle (land or water), you can add your proficiency bonus to any check you make to control that kind of vehicle in difficult circumstances.\r\n\r\n**Rowed Vessels** Keelboats and rowboats are used on lakes and rivers. If going downstream, add the speed of the current (typically 3 miles per hour) to the speed of the vehicle. These vehicles can’t be rowed against any significant current, but they can be pulled upstream by draft animals on the shores. A rowboat weighs 100 pounds, in case adventurers carry it over land.",
        "Name": "Mounts and Vehicles"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Opportunities abound to find treasure, equipment, weapons, armor, and more in the dungeons you explore. Normally, you can sell your treasures and trinkets when you return to a town or other settlement, provided that you can find buyers and merchants interested in your loot.\r\n\r\n## %{color:steelblue}Arms, Armor, and Other Equipment%\r\nAs a general rule, undamaged weapons, armor, and other equipment fetch half their cost when sold in a market. Weapons and armor used by monsters are rarely in good enough condition to sell.\r\n\r\n## %{color:steelblue}Magic Items%\r\nSelling magic items is problematic. Finding someone to buy a potion or a scroll isn't too hard, but other items are out of the realm of most but the wealthiest nobles. Likewise, aside from a few common magic items, you won't normally come across magic items or spells to purchase. The value of magic is far beyond simple gold and should always be treated as such.\r\n\r\n## %{color:steelblue}Gems, Jewelry, and Art Objects%\r\nThese items retain their full value in the marketplace, and you can either trade them in for coin or use them as currency for other transactions. For exceptionally valuable treasures, the DM might require you to find a buyer in a large town or larger community first.\r\n\r\n## %{color:steelblue}Trade Goods and Other%\r\nOn the borderlands, many people conduct transactions through barter. Like gems and art objects, trade goods--bars of iron, bags of salt, livestock, and so on--retain their full value in the market and can be used as currency.",
        "Name": "Selling Treasure"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Adventurers can pay nonplayer characters to assist them or act on their behalf in a variety of circumstances. Most such hirelings have fairly ordinary skills, while others are masters of a craft or art, and a few are experts with specialized adventuring skills.\r\n\r\nSome of the most basic types of hirelings appear on the Services table. Other common hirelings include any of the wide variety of people who inhabit a typical town or city, when the adventurers pay them to perform a specific task. For example, a wizard might pay a carpenter to construct an elaborate chest (and its miniature replica) for use in the secret chest spell. A fighter might commission a blacksmith to forge a special sword. A bard might pay a tailor to make exquisite clothing for an upcoming performance in front of the duke.\r\n\r\nOther hirelings provide more expert or dangerous services. Mercenary soldiers paid to help the adventurers take on a hobgoblin army are hirelings, as are sages hired to research ancient or esoteric lore. If a high-level adventurer establishes a stronghold of some kind, he or she might hire a whole staff of servants and agents to run the place, from a castellan or steward to menial laborers to keep the stables clean. These hirelings often enjoy a long-term contract that includes a place to live within the stronghold as part of the offered compensation.\r\n\r\nSkilled hirelings include anyone hired to perform a service that involves a proficiency (including weapon, tool, or skill): a mercenary, artisan, scribe, and so on. The pay shown is a minimum; some expert hirelings require more pay. Untrained hirelings are hired for menial work that requires no particular skill and can include laborers, porters, maids, and similar workers.\r\n\r\n## %{color:steelblue}Spellcasting Services%\r\nPeople who are able to cast spells don't fall into the category of ordinary hirelings. It might be possible to find someone willing to cast a spell in exchange for coin or favors, but it is rarely easy and no established pay rates exist. As a rule, the higher the level of the desired spell, the harder it is to find someone who can cast it and the more it costs.\r\n\r\nHiring someone to cast a relatively common spell of 1st or 2nd level, such as cure wounds or identify, is easy enough in a city or town, and might cost 10 to 50 gold pieces (plus the cost of any expensive material components). Finding someone able and willing to cast a higher-level spell might involve traveling to a large city, perhaps one with a university or prominent temple. Once found, the spellcaster might ask for a service instead of payment -- the kind of service that only adventurers can provide, such as retrieving a rare item from a dangerous locale or traversing a monster-infested wilderness to deliver something important to a distant settlement.",
        "Name": "Services"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Most wealth is not in coins. It is measured in livestock, grain, land, rights to collect taxes, or rights to resources (such as a mine or a forest).\r\n\r\nGuilds, nobles, and royalty regulate trade. Chartered companies are granted rights to conduct trade along certain routes, to send merchant ships to various ports, or to buy or sell specific goods. Guilds set prices for the goods or services that they control, and determine who may or may not offer those goods and services. Merchants commonly exchange trade goods without using currency. The Trade Goods table shows the value of commonly exchanged goods.",
        "Name": "Trade Goods"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Wealth appears in many forms in a D&D world. Coins, gemstones, trade goods, art objects, animals, and property can reflect your character’s financial well-being. Members of the peasantry trade in goods, bartering for what they need and paying taxes in grain and cheese.\r\n\r\nMembers of the nobility trade either in legal rights, such as the rights to a mine, a port, or farmland, or in gold bars, measuring gold by the pound rather than by the coin. Only merchants, adventurers, and those offering professional services for hire commonly deal in coins.\r\n\r\n## %{color:steelblue}Coinage% \r\nCommon coins come in several different denominations based on the relative worth of the metal from which they are made. The three most common coins are the gold piece (gp), the silver piece (sp), and the copper piece (cp).\r\n\r\nWith one gold piece, a character can buy a bedroll, 50 feet of good rope, or a goat. A skilled (but not exceptional) artisan can earn one gold piece a day. The gold piece is the standard unit of measure for wealth, even if the coin itself is not commonly used. When merchants discuss deals that involve goods or services worth hundreds or thousands of gold pieces, the transactions don't usually involve the exchange of individual coins. Rather, the gold piece is a standard measure of value, and the actual exchange is in gold bars, letters of credit, or valuable goods.\r\n\r\nOne gold piece is worth ten silver pieces, the most prevalent coin among commoners. A silver piece buys a laborer's work for half a day, a flask of lamp oil, or a night's rest in a poor inn.\r\n\r\nOne silver piece is worth ten copper pieces, which are common among laborers and beggars. A single copper piece buys a candle, a torch, or a piece of chalk.\r\n\r\nIn addition, unusual coins made of other precious metals sometimes appear in treasure hoards. The electrum piece (ep) and the platinum piece (pp) originate from fallen empires and lost kingdoms, and they sometimes arouse suspicion and skepticism when used in transactions. An electrum piece is worth five silver pieces, and a platinum piece is worth ten gold pieces.\r\n\r\nA standard coin weighs about a third of an ounce, so fifty coins weigh a pound.",
        "Name": "Wealth"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Sometimes characters don't have their weapons and have to attack with whatever is at hand. An improvised weapon includes any object you can wield in one or two hands, such as broken glass, a table leg, a frying pan, a wagon wheel, or a dead goblin.\r\n\r\nOften, an improvised weapon is similar to an actual weapon and can be treated as such. For example, a table leg is akin to a club. At the DM's option, a character proficient with a weapon can use a similar object as if it were that weapon and use his or her proficiency bonus.\r\n\r\nAn object that bears no resemblance to a weapon deals 1d4 damage (the DM assigns a damage type appropriate to the object). If a character uses a ranged weapon to make a melee attack, or throws a melee weapon that does not have the thrown property, it also deals 1d4 damage. An improvised thrown weapon has a normal range of 20 feet and a long range of 60 feet.",
            "Name": "Traits"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Your race, class, and feats can grant you proficiency with certain weapons or categories of weapons. The two categories are simple and martial. Most people can use simple weapons with proficiency. These weapons include clubs, maces, and other weapons often found in the hands of commoners. Martial weapons, including swords, axes, and polearms, require more specialized training to use effectively. Most warriors use martial weapons because these weapons put their fighting style and training to best use.\r\n\r\nProficiency with a weapon allows you to add your proficiency bonus to the attack roll for any attack you make with that weapon. If you make an attack roll using a weapon with which you lack proficiency, you do not add your proficiency bonus to the attack roll.",
            "Name": "Proficiency"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Many weapons have special properties related to their use, as shown in the Weapons table.\r\n\r\n**Ammunition** You can use a weapon that has the ammunition property to make a ranged attack only if you have ammunition to fire from the weapon. Each time you attack with the weapon, you expend one piece of ammunition. Drawing the ammunition from a quiver, case, or other container is part of the attack (you need a free hand to load a one-handed weapon). At the end of the battle, you can recover half your expended ammunition by taking a minute to search the battlefield.\r\n\r\nIf you use a weapon that has the ammunition property to make a melee attack, you treat the weapon as an improvised weapon (see \"Improvised Weapons\" later in the section). A sling must be loaded to deal any damage when used in this way.\r\n\r\n**Finesse** When making an attack with a finesse weapon, you use your choice of your Strength or Dexterity modifier for the attack and damage rolls. You must use the same modifier for both rolls.\r\n\r\n**Heavy** Creatures that are Small or Tiny have disadvantage on attack rolls with heavy weapons. A heavy weapon's size and bulk make it too large for a Small or Tiny creature to use effectively.\r\n\r\n**Light** A light weapon is small and easy to handle, making it ideal for use when fighting with two weapons.\r\n\r\n**Loading** Because of the time required to load this weapon, you can fire only one piece of ammunition from it when you use an action, bonus action, or reaction to fire it, regardless of the number of attacks you can normally make.\r\n\r\n**Range** A weapon that can be used to make a ranged attack has a range shown in parentheses after the ammunition or thrown property. The range lists two numbers. The first is the weapon's normal range in feet, and the second indicates the weapon's long range. When attacking a target beyond normal range, you have disadvantage on the attack roll. You can't attack a target beyond the weapon's long range.\r\n\r\n**Reach** This weapon adds 5 feet to your reach when you attack with it, as well as when determining your reach for opportunity attacks with it.\r\n\r\n**Special** A weapon with the special property has unusual rules governing its use, explained in the weapon's description (see \"Special Weapons\" later in this section).\r\n\r\n**Thrown** If a weapon has the thrown property, you can throw the weapon to make a ranged attack. If the weapon is a melee weapon, you use the same ability modifier for that attack roll and damage roll that you would use for a melee attack with the weapon. For example, if you throw a handaxe, you use your Strength, but if you throw a dagger, you can use either your Strength or your Dexterity, since the dagger has the finesse property**\r\n\r\n**Two-Handed** This weapon requires two hands when you attack with it.\r\n\r\n**Versatile** This weapon can be used with one or two hands. A damage value in parentheses appears with the property--the damage when the weapon is used with two hands to make a melee attack.",
            "Name": "Properties"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Some monsters that have immunity or resistance to nonmagical weapons are susceptible to silver weapons, so cautious adventurers invest extra coin to plate their weapons with silver. You can silver a single weapon or ten pieces of ammunition for 100 gp. This cost represents not only the price of the silver, but the time and expertise needed to add silver to the weapon without making it less effective.",
            "Name": "Silvered"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Weapons with special rules are described here.\r\n\r\n**Lance** You have disadvantage when you use a lance to attack a target within 5 feet of you. Also, a lance requires two hands to wield when you aren't mounted.\r\n\r\n**Net** A Large or smaller creature hit by a net is restrained until it is freed. A net has no effect on creatures that are formless, or creatures that are Huge or larger. A creature can use its action to make a DC 10 Strength check, freeing itself or another creature within its reach on a success. Dealing 5 slashing damage to the net (AC 10) also frees the creature without harming it, ending the effect and destroying the net.\r\n\r\nWhen you use an action, bonus action, or reaction to attack with a net, you can make only one attack regardless of the number of attacks you can normally make.",
            "Name": "Special"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Your class grants proficiency in certain weapons, reflecting both the class's focus and the tools you are most likely to use. Whether you favor a longsword or a longbow, your weapon and your ability to wield it effectively can mean the difference between life and death while adventuring.\r\n\r\nThe Weapons table shows the most common weapons used in the fantasy gaming worlds, their price and weight, the damage they deal when they hit, and any special properties they possess. Every weapon is classified as either melee or ranged. A melee weapon is used to attack a target within 5 feet of you, whereas a ranged weapon is used to attack a target at a distance.",
        "Name": "Weapons"
      }
    ],
    "IsExpanded": false,
    "Markdown": "When you create your character, you receive equipment based on a combination of your class and background. Alternatively, you can start with a number of gold pieces based on your class and spend them on items from the lists in this section. See the Starting Wealth by Class table to determine how much gold you have to spend.\r\n\r\nYou decide how your character came by this starting equipment. It might have been an inheritance, or goods that the character purchased during his or her upbringing. You might have been equipped with a weapon, armor, and a backpack as part of military service. You might even have stolen your gear. A weapon could be a family heirloom, passed down from generation to generation until your character finally took up the mantle and followed in an ancestor’s adventurous footsteps.",
    "Name": "Equipment"
  },
  {
    "GlossaryEntries": [
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "A typical creature in the game world has an alignment, which broadly describes its moral and personal attitudes. Alignment is a combination of two factors: one identifies morality (good, evil, or neutral), and the other describes attitudes toward society and order (lawful, chaotic, or neutral). Thus, nine distinct alignments define the possible combinations.\r\n\r\nThese brief summaries of the nine alignments describe the typical behavior of a creature with that alignment. Individuals might vary significantly from that typical behavior, and few people are perfectly and consistently faithful to the precepts of their alignment.\r\n\r\n## %{color:steelblue}Lawful Good (LG)% \r\nCreatures can be counted on to do the right thing as expected by society. Gold dragons and paladins are typically lawful good.\r\n\r\n## %{color:steelblue}Neutral Good (NG)% \r\nFolk do the best they can to help others according to their needs. Many celestials are neutral good.\r\n\r\n## %{color:steelblue}Chaotic Good (CG)% \r\nCreatures act as their conscience directs, with little regard for what others expect. Copper dragons and unicorns are typically chaotic good.\r\n\r\n## %{color:steelblue}Lawful Neutral (LN)% \r\nIndividuals act in accordance with law, tradition, or personal codes. Modrons and many wizards and monks are lawful neutral.\r\n\r\n## %{color:steelblue}Neutral (N)% \r\nThis is the alignment of those who prefer to steer clear of moral questions and don’t take sides, doing what seems best at the time. Druids are traditionally neutral, as are typical townsfolk.\r\n\r\n## %{color:steelblue}Chaotic Neutral (CN)% \r\nCreatures follow their whims, holding their personal freedom above all else. Many rogues and bards are chaotic neutral.\r\n\r\n## %{color:steelblue}Lawful Evil (LE)% \r\nCreatures methodically take what they want, within the limits of a code of tradition, loyalty, or order. Devils and blue dragons are typically lawful evil.\r\n\r\n## %{color:steelblue}Neutral Evil (NE)% \r\nThis is the alignment of those who do whatever they can get away with, without compassion or qualms. Yugoloths are typically neutral evil.\r\n\r\n## %{color:steelblue}Chaotic Evil (CE)% \r\nCreatures act with arbitrary violence, spurred by their greed, hatred, or bloodlust. Demons and red dragons are typically chaotic evil.\r\n\r\nFor many thinking creatures, alignment is a moral choice. Humans, dwarves, elves, and other people can choose whether to follow the paths of good or evil, law or chaos. According to myth, the gods who created these folk gave them free will to choose their moral paths.\r\n\r\nAlignment is an essential part of the nature of celestials and fiends. Both types of creatures are associated with metaphysical planes of existence—specifically the Outer Planes—that embody certain alignments. For example, most devils hail from the Nine Hells, a plane of lawful evil. A devil does not choose to be lawful evil or tend toward lawful evil, but rather it is lawful evil in its essence. If it somehow ceases to be lawful evil, it changes into something new—a transformation worthy of legend.\r\n\r\nMost creatures that lack the capacity for rational thought do not have alignments—they are unaligned. Such a creature is incapable of making a moral or ethical choice and acts according to its bestial nature. Sharks are savage predators, for example, but they are not evil; they have no alignment.",
        "Name": "Alignment"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Create one bond for your character. Bonds represent a character’s connections to people, places, and events in the world. They tie you to things from your background. They might inspire you to heights of heroism, or lead you to act against your own best interests if they are threatened. They can work very much like ideals, driving a character’s motivations and goals.\r\n\r\nBonds might answer any of these questions: Whom do you care most about? To what place do you feel a special connection? What is your most treasured possession?\r\n\r\nYour bonds might be tied to your class, your background, your race, or some other aspect of your character’s history or personality. You might also gain new bonds over the course of your adventures.",
            "Name": "Bonds"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Choose a flaw for your character. Your character’s flaw represents some vice, compulsion, fear, or weakness—in particular, anything that someone else could exploit to bring you to ruin or cause you to act against your best interests. More significant than negative personality traits, a flaw might answer any of these questions: What enrages you? What’s the one person, concept, or event that you are terrified of? What are your vices?",
            "Name": "Flaws"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Describe one ideal that drives your character. Your ideals are the things that you believe in most strongly, the fundamental moral and ethical principles that compel you to act as you do. Ideals encompass everything from your life goals to your core belief system.\r\n\r\nIdeals might answer any of these questions: What are the principles that you will never betray? What would prompt you to make sacrifices? What drives you to act and guides your goals and ambitions? What is the single most important thing you strive for?\r\n\r\nYou can choose any ideals you like, but your character’s alignment is a good place to start defining them. Each background in this chapter includes six suggested ideals. Five of them are linked to aspects of alignment: law, chaos, good, evil, and neutrality. The last one has more to do with the particular background than with moral or ethical perspectives.",
            "Name": "Ideals"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Give your character two personality traits. Personality traits are small, simple ways to help you set your character apart from every other character. Your personality traits should tell you something interesting and fun about your character. They should be self-descriptions that are specific about what makes your character stand out. “I’m smart” is not a good trait, because it describes a lot of characters. “I’ve read every book in Candlekeep” tells you something specific about your character’s interests and disposition.\r\n\r\nPersonality traits might describe the things your character likes, his or her past accomplishments, things your character dislikes or fears, your character’s self-attitude or mannerisms, or the influence of his or her ability scores.\r\n\r\nA useful place to start thinking about personality traits is to look at your highest and lowest ability scores and define one trait related to each. Either one could be positive or negative: you might work hard to overcome a low score, for example, or be cocky about your high score.",
            "Name": "Traits"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Fleshing out your character’s personality—the array of traits, mannerisms, habits, beliefs, and flaws that give a person a unique identity—will help you bring him or her to life as you play the game. Four categories of characteristics are presented here: personality traits, ideals, bonds, and flaws. Beyond those categories, think about your character’s favorite words or phrases, tics and habitual gestures, vices and pet peeves, and whatever else you can imagine.\r\n\r\nEach background presented later in this chapter includes suggested characteristics that you can use to spark your imagination. You’re not bound to those options, but they’re a good starting point.",
        "Name": "Characteristics"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Inspiration is a rule the game master can use to reward you for playing your character in a way that’s true to his or her personality traits, ideal, bond, and flaw. By using inspiration, you can draw on your personality trait of compassion for the downtrodden to give you an edge in negotiating with the Beggar Prince. Or inspiration can let you call on your bond to the defense of your home village to push past the effect of a spell that has been laid on you.\r\n\r\n## %{color:steelblue}Gaining Inspiration% \r\nYour DM can choose to give you inspiration for a variety of reasons. Typically, DMs award it when you play out your personality traits, give in to the drawbacks presented by a flaw or bond, and otherwise portray your character in a compelling way. Your DM will tell you how you can earn inspiration in the game.\r\n\r\nYou either have inspiration or you don’t - you can’t stockpile multiple “inspirations” for later use.\r\n\r\n## %{color:steelblue}Using Inspiration%\r\nIf you have inspiration, you can expend it when you make an attack roll, saving throw, or ability check. Spending your inspiration gives you advantage on that roll.\r\n\r\nAdditionally, if you have inspiration, you can reward another player for good roleplaying, clever thinking, or simply doing something exciting in the game. When another player character does something that really contributes to the story in a fun and interesting way, you can give up your inspiration to give that character inspiration.",
        "Name": "Inspiration"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Your race indicates the languages your character can speak by default, and your background might give you access to one or more additional languages of your choice. Note these languages on your character sheet.\r\n\r\nChoose your languages from the Standard Languages table, or choose one that is common in your campaign. With your DM’s permission, you can instead choose a language from the Exotic Languages table or a secret language, such as thieves’ cant or the tongue of druids.\r\n\r\nSome of these languages are actually families of languages with many dialects. For example, the Primordial language includes the Auran, Aquan, Ignan, and Terran dialects, one for each of the four elemental planes. Creatures that speak different dialects of the same language can communicate with one another.",
        "Name": "Languages"
      }
    ],
    "IsExpanded": false,
    "Markdown": "Characters are defined by much more than their race and class. They’re individuals with their own stories, interests, connections, and capabilities beyond those that class and race define. This section expounds on the details that distinguish characters from one another, including the basics of name and physical description, the rules of backgrounds and languages, and the finer points of personality and alignment.",
    "Name": "Personality"
  },
  {
    "GlossaryEntries": [
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Every spell has a level from 0 to 9. A spell's level is a general indicator of how powerful it is, with the lowly (but still impressive) magic missile at 1st level and the earth-shaking wish at 9th. Cantrips -- simple but powerful spells that characters can cast almost by rote -- are level 0. The higher a spell's level, the higher level a spellcaster must be to use that spell.\r\n\r\nSpell level and character level don't correspond directly. Typically, a character has to be at least 17th level, not 9th level, to cast a 9th-level spell.",
        "Name": "Spell Level"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Before a spellcaster can use a spell, he or she must have the spell firmly fixed in mind, or must have access to the spell in a magic item. Members of a few classes, including bards and sorcerers, have a limited list of spells they know that are always fixed in mind. The same thing is true of many magic-using monsters. Other spellcasters, such as clerics and wizards, undergo a process of preparing spells. This process varies for different classes, as detailed in their descriptions.\r\n\r\nIn every case, the number of spells a caster can have fixed in mind at any given time depends on the character's level.",
        "Name": "Known and Prepared Spells"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "When a spellcaster casts a spell using a slot that is of a higher level than the spell, the spell assumes the higher level for that casting. For instance, if Umara casts magic missile using one of her 2nd-level slots, that magic missile is 2nd level.\r\n\r\nEffectively, the spell expands to fill the slot it is put into.\r\n\r\nSome spells, such as magic missile and cure wounds, have more powerful effects when cast at a higher level, as detailed in a spell's description.",
            "Name": "Casting at Higher Levels"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Because of the mental focus and precise gestures required for spellcasting, you must be proficient with the armor you are wearing to cast a spell. You are otherwise too distracted and physically hampered by your armor for spellcasting.",
            "Name": "Casting in Armor"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "A cantrip is a spell that can be cast at will, without using a spell slot and without being prepared in advance. Repeated practice has fixed the spell in the caster's mind and infused the caster with the magic needed to produce the effect over and over. A cantrip's spell level is 0.",
            "Name": "Cantrips"
          }
        ],
        "IsExpanded": false,
        "Markdown": "Regardless of how many spells a caster knows or prepares, he or she can cast only a limited number of spells before resting. Manipulating the fabric of magic and channeling its energy into even a simple spell is physically and mentally taxing, and higher- level spells are even more so. Thus, each spellcasting class's description (except that of the warlock) includes a table showing how many spell slots of each spell level a character can use at each character level. For example, the 3rd-level wizard Umara has four 1st-level spell slots and two 2nd-level slots.\r\n\r\nWhen a character casts a spell, he or she expends a slot of that spell's level or higher, effectively \"filling\" a slot with the spell. You can think of a spell slot as a groove of a certain size--small for a 1st-level slot, larger for a spell of higher level. A 1st-level spell fits into a slot of any size, but a 9th-level spell fits only in a 9th-level slot. So when Umara casts magic missile, a 1st-level spell, she spends one of her four 1st-level slots and has three remaining.\r\n\r\nFinishing a long rest restores any expended spell slots.\r\n\r\nSome characters and monsters have special abilities that let them cast spells without using spell slots. For example, a monk who follows the Way of the Four Elements, a warlock who chooses certain eldritch invocations, and a pit fiend from the Nine Hells can all cast spells in such a way.",
        "Name": "Spell Slots"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Certain spells have a special tag: ritual. Such a spell can be cast following the normal rules for spellcasting, or the spell can be cast as a ritual. The ritual version of a spell takes 10 minutes longer to cast than normal. It also doesn't expend a spell slot, which means the ritual version of a spell can't be cast at a higher level.\r\n\r\nTo cast a spell as a ritual, a spellcaster must have a feature that grants the ability to do so. The cleric and the druid, for example, have such a feature. The caster must also have the spell prepared or on his or her list of spells known, unless the character's ritual feature specifies otherwise, as the wizard's does.",
        "Name": "Rituals"
      },
      {
        "GlossaryEntries": [
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Most spells require a single action to cast, but some spells require a bonus action, a reaction, or much more time to cast.\r\n\r\n## %{color:steelblue}Bonus Action%\r\nA spell cast with a bonus action is especially swift. You must use a bonus action on your turn to cast the spell, provided that you haven't already taken a bonus action this turn. You can't cast another spell during the same turn, except for a cantrip with a casting time of 1 action.\r\n\r\n## %{color:steelblue}Reactions%\r\nSome spells can be cast as reactions. These spells take a fraction of a second to bring about and are cast in response to some event. If a spell can be cast as a reaction, the spell description tells you exactly when you can do so.\r\n\r\n## %{color:steelblue}Longer Casting Times%\r\nCertain spells (including spells cast as rituals) require more time to cast: minutes or even hours. When you cast a spell with a casting time longer than a single action or reaction, you must spend your action each turn casting the spell, and you must maintain your concentration while you do so. If your concentration is broken, the spell fails, but you don't expend a spell slot. If you want to try casting the spell again, you must start over.",
            "Name": "Casting Time"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "The target of a spell must be within the spell's range. For a spell like magic missile, the target is a creature. For a spell like fireball, the target is the point in space where the ball of fire erupts.\r\n\r\nMost spells have ranges expressed in feet. Some spells can target only a creature (including you) that you touch. Other spells, such as the shield spell, affect only you. These spells have a range of self.\r\n\r\nSpells that create cones or lines of effect that originate from you also have a range of self, indicating that the origin point of the spell's effect must be you.\r\n\r\nOnce a spell is cast, its effects aren't limited by its range, unless the spell's description says otherwise.",
            "Name": "Range"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "A spell's components are the physical requirements you must meet in order to cast it. Each spell's description indicates whether it requires verbal (V), somatic (S), or material (M) components. If you can't provide one or more of a spell's components, you are unable to cast the spell.\r\n\r\n## %{color:steelblue}Verbal (V)%\r\nMost spells require the chanting of mystic words. The words themselves aren't the source of the spell's power; rather, the particular combination of sounds, with specific pitch and resonance, sets the threads of magic in motion. Thus, a character who is gagged or in an area of silence, such as one created by the silence spell, can't cast a spell with a verbal component.\r\n\r\n## %{color:steelblue}Somatic (S)%\r\nSpellcasting gestures might include a forceful gesticulation or an intricate set of gestures. If a spell requires a somatic component, the caster must have free use of at least one hand to perform these gestures.\r\n\r\n## %{color:steelblue}Material (M)%\r\nCasting some spells requires particular objects, specified in parentheses in the component entry. A character can use a component pouch or a spellcasting focus (found in “Equipment”) in place of the components specified for a spell. But if a cost is indicated for a component, a character must have that specific component before he or she can cast the spell.\r\n\r\nIf a spell states that a material component is consumed by the spell, the caster must provide this component for each casting of the spell. A spellcaster must have a hand free to access a spell's material components -- or to hold a spellcasting focus -- but it can be the same hand that he or she uses to perform somatic components.",
            "Name": "Components"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "A spell's duration is the length of time the spell persists. A duration can be expressed in rounds, minutes, hours, or even years. Some spells specify that their effects last until the spells are dispelled or destroyed.\r\n\r\n## %{color:steelblue}Instantaneous%\r\nMany spells are instantaneous. The spell harms, heals, creates, or alters a creature or an object in a way that can't be dispelled, because its magic exists only for an instant.\r\n\r\n## %{color:steelblue}Concentration%\r\nSome spells require you to maintain concentration in order to keep their magic active. If you lose concentration, such a spell ends.\r\n\r\nIf a spell must be maintained with concentration, that fact appears in its Duration entry, and the spell specifies how long you can concentrate on it. You can end concentration at any time (no action required).\r\n\r\nNormal activity, such as moving and attacking, doesn't interfere with concentration. The following factors can break concentration:\r\n* Casting another spell that requires concentration. You lose concentration on a spell if you cast another spell that requires concentration. You can't concentrate on two spells at once.\r\n* Taking damage. Whenever you take damage while you are concentrating on a spell, you must make a Constitution saving throw to maintain your concentration. The DC equals 10 or half the damage you take, whichever number is higher. If you take damage from multiple sources, such as an arrow and a dragon's breath, you make a separate saving throw for each source of damage.\r\n* Being incapacitated or killed. You lose concentration on a spell if you are incapacitated or if you die.\r\n\r\nThe DM might also decide that certain environmental phenomena, such as a wave crashing over you while you're on a storm-tossed ship, require you to succeed on a DC 10 Constitution saving throw to maintain concentration on a spell.",
            "Name": "Duration"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "A typical spell requires you to pick one or more targets to be affected by the spell's magic. A spell's description tells you whether the spell targets creatures, objects, or a point of origin for an area of effect (described below).\r\n\r\nUnless a spell has a perceptible effect, a creature might not know it was targeted by a spell at all. An effect like crackling lightning is obvious, but a more subtle effect, such as an attempt to read a creature's thoughts, typically goes unnoticed, unless a spell says otherwise.\r\n\r\n## %{color:steelblue}A Clear Path to the Target%\r\nTo target something, you must have a clear path to it, so it can't be behind total cover. If you place an area of effect at a point that you can't see and an obstruction, such as a wall, is between you and that point, the point of origin comes into being on the near side of that obstruction.\r\n\r\n## %{color:steelblue}Targeting Yourself%\r\nIf a spell targets a creature of your choice, you can choose yourself, unless the creature must be hostile or specifically a creature other than you. If you are in the area of effect of a spell you cast, you can target yourself",
            "Name": "Targets"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Spells such as burning hands and cone of cold cover an area, allowing them to affect multiple creatures at once.\r\n\r\nA spell's description specifies its area of effect, which typically has one of five different shapes: cone, cube, cylinder, line, or sphere. Every area of effect has a point of origin, a location from which the spell's energy erupts. The rules for each shape specify how you position its point of origin. Typically, a point of origin is a point in space, but some spells have an area whose origin is a creature or an object.\r\n\r\nA spell's effect expands in straight lines from the point of origin. If no unblocked straight line extends from the point of origin to a location within the area of effect, that location isn't included in the spell's area. To block one of these imaginary lines, an obstruction must provide total cover.\r\n\r\n## %{color:steelblue}Cone%\r\nA cone extends in a direction you choose from its point of origin. A cone's width at a given point along its length is equal to that point's distance from the point of origin. A cone's area of effect specifies its maximum length.\r\n\r\nA cone's point of origin is not included in the cone's area of effect, unless you decide otherwise.\r\n\r\n## %{color:steelblue}Cube%\r\nYou select a cube's point of origin, which lies anywhere on a face of the cubic effect. The cube's size is expressed as the length of each side.\r\n\r\nA cube's point of origin is not included in the cube's area of effect, unless you decide otherwise.\r\n\r\n## %{color:steelblue}Cylinder%\r\nA cylinder's point of origin is the center of a circle of a particular radius, as given in the spell description. The circle must either be on the ground or at the height of the spell effect. The energy in a cylinder expands in straight lines from the point of origin to the perimeter of the circle, forming the base of the cylinder. The spell's effect then shoots up from the base or down from the top, to a distance equal to the height of the cylinder.\r\n\r\nA cylinder's point of origin is included in the cylinder's area of effect.\r\n\r\n## %{color:steelblue}Line%\r\nA line extends from its point of origin in a straight path up to its length and covers an area defined by its width.\r\n\r\nA line's point of origin is not included in the line's area of effect, unless you decide otherwise.\r\n\r\n## %{color:steelblue}Sphere%\r\nYou select a sphere's point of origin, and the sphere extends outward from that point. The sphere's size is expressed as a radius in feet that extends from the point.\r\n\r\nA sphere's point of origin is included in the sphere's area of effect.",
            "Name": "Areas of Effect"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Many spells specify that a target can make a saving throw to avoid some or all of a spell's effects. The spell specifies the ability that the target uses for the save and what happens on a success or failure.\r\n\r\nThe DC to resist one of your spells equals 8 + your spellcasting ability modifier + your proficiency bonus + any special modifiers.",
            "Name": "Saving Throws"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "Some spells require the caster to make an attack roll to determine whether the spell effect hits the intended target. Your attack bonus with a spell attack equals your spellcasting ability modifier + your proficiency bonus.\r\n\r\nMost spells that require attack rolls involve ranged attacks. Remember that you have disadvantage on a ranged attack roll if you are within 5 feet of a hostile creature that can see you and that isn't incapacitated.",
            "Name": "Attack Rolls"
          },
          {
            "GlossaryEntries": [],
            "IsExpanded": false,
            "Markdown": "The effects of different spells add together while the durations of those spells overlap. The effects of the same spell cast multiple times don't combine, however. Instead, the most potent effect--such as the highest bonus--from those castings applies while their durations overlap, or the most recent effect applies if the castings are equally potent and their durations overlap.\r\n\r\nFor example, if two clerics cast bless on the same target, that character gains the spell's benefit only once; he or she doesn't get to roll two bonus dice.",
            "Name": "Combining Magical Effects"
          }
        ],
        "IsExpanded": false,
        "Markdown": "When a character casts any spell, the same basic rules are followed, regardless of the character's class or the spell's effects.\r\n\r\nEach spell description begins with a block of information, including the spell's name, level, school of magic, casting time, range, components, and duration. The rest of a spell entry describes the spell's effect.",
        "Name": "Casting a Spell"
      },
      {
        "GlossaryEntries": [],
        "IsExpanded": false,
        "Markdown": "Academies of magic group spells into eight categories called schools of magic. Scholars, particularly wizards, apply these categories to all spells, believing that all magic functions in essentially the same way, whether it derives from rigorous study or is bestowed by a deity.\r\n\r\nThe schools of magic help describe spells; they have no rules of their own, although some rules refer to the schools.\r\n\r\n## %{color:steelblue}Abjuration%\r\nAbjuration spells are protective in nature, though some of them have aggressive uses. They create magical barriers, negate harmful effects, harm trespassers, or banish creatures to other planes of existence.\r\n\r\n## %{color:steelblue}Conjuration%\r\nConjuration spells involve the transportation of objects and creatures from one location to another. Some spells summon creatures or objects to the caster's side, whereas others allow the caster to teleport to another location. Some conjurations create objects or effects out of nothing.\r\n\r\n## %{color:steelblue}Divination%\r\nDivination spells reveal information, whether in the form of secrets long forgotten, glimpses of the future, the locations of hidden things, the truth behind illusions, or visions of distant people or places.\r\n\r\n## %{color:steelblue}Enchantment%\r\nEnchantment spells affect the minds of others, influencing or controlling their behavior. Such spells can make enemies see the caster as a friend, force creatures to take a course of action, or even control another creature like a puppet.\r\n\r\n## %{color:steelblue}Evocation%\r\nEvocation spells manipulate magical energy to produce a desired effect. Some call up blasts of fire or lightning. Others channel positive energy to heal wounds.\r\n\r\n## %{color:steelblue}Illusion%\r\nIllusion spells deceive the senses or minds of others. They cause people to see things that are not there, to miss things that are there, to hear phantom noises, or to remember things that never happened. Some illusions create phantom images that any creature can see, but the most insidious illusions plant an image directly in the mind of a creature.\r\n\r\n## %{color:steelblue}Necromancy%\r\nNecromancy spells manipulate the energies of life and death. Such spells can grant an extra reserve of life force, drain the life energy from another creature, create the undead, or even bring the dead back to life.\r\n\r\nCreating the undead through the use of necromancy spells such as animate dead is not a good act, and only evil casters use such spells frequently.\r\n\r\n## %{color:steelblue}Transmutation%\r\nTransmutation spells change the properties of a creature, object, or environment. They might turn an enemy into a harmless creature, bolster the strength of an ally, make an object move at the caster's command, or enhance a creature's innate healing abilities to rapidly recover from injury.",
        "Name": "Schools of Magic"
      }
    ],
    "IsExpanded": false,
    "Markdown": "Magic permeates the worlds of D&D and most often appears in the form of a spell.\r\n\r\nA spell is a discrete magical effect, a single shaping of the magical energies that suffuse the multiverse into a specific, limited expression. In casting a spell, a character carefully plucks at the invisible strands of raw magic suffusing the world, pins them in place in a particular pattern, sets them vibrating in a specific way, and then releases them to unleash the desired effect--in most cases, all in the span of seconds.\r\n\r\nSpells can be versatile tools, weapons, or protective wards. They can deal damage or undo it, impose or remove conditions, drain life energy away, and restore life to the dead.\r\n\r\nUncounted thousands of spells have been created over the course of the multiverse's history, and many of them are long forgotten. Some might yet lie recorded in crumbling spellbooks hidden in ancient ruins or trapped in the minds of dead gods. Or they might someday be reinvented by a character who has amassed enough power and wisdom to do so.",
    "Name": "Spellcasting"
  }
]